# -*- coding: utf-8 -*-
import base64
import io
import os
import random
import subprocess
import tempfile
import fitz  # PyMuPDF
from PIL import Image
import streamlit as st
import streamlit.components.v1 as components

# ページの基本設定
st.set_page_config(
    page_title="数学のガチャ", page_icon="数学", layout="wide"
)

# ---------------------------------------------------------
# パスワード認証機能
# ---------------------------------------------------------
def check_password():
    """パスワードが正しく入力されているか確認する関数"""
    if "password_correct" not in st.session_state:
        st.session_state["password_correct"] = False

    if st.session_state["password_correct"]:
        return True

    st.title("パスワード保護")
    password_input = st.text_input("パスワードを入力してください", type="password")

    if st.button("ログイン", type="primary"):
        if password_input == "Inki1985":
            st.session_state["password_correct"] = True
            st.rerun()
        else:
            st.error("パスワードが違います")

    return False

if not check_password():
    st.stop()

# ---------------------------------------------------------
# 階層化された教科書・問題データ（全分野統合版）
# ---------------------------------------------------------
question_database = {
    "教科書": {
        "数Ⅰ": {
            "第1章 数と式": {
                "第1節 式の計算": {
                    "1. 多項式": [
                        "次の単項式の係数と次数をいえ：$4a^5$",
                        "次の単項式の係数と次数をいえ：$-2xy$",
                        "次の単項式の係数と次数をいえ：$-x^3y^2z$",
                        "次の単項式で、[x]に着目したときの係数と次数をいえ：$-5ax^3y^2$",
                        "次の単項式で、[y]に着目したときの係数と次数をいえ：$-5ax^3y^2$",
                        "次の単項式で、[a]に着目したときの係数と次数をいえ：$-5ax^3y^2$",
                        "次の単項式で、[x と y]に着目したときの係数と次数をいえ：$2abxy^3$",
                        "次の多項式の同類項をまとめよ。また、何次式か：$4x^2 - 2x - 5 - 3x^2 + 8x - 3$",
                        "次の多項式の同類項をまとめよ。また、何次式か：$3a^2 - ab + 6b^2 - 5a^2 + 9ab - 4b^2$",
                        "次の多項式の同類項をまとめよ。また、何次式か：$-2x^4 + x^3 - 8x^2 + 7x - 1 + 2x^4 - 3x^3 + x + 5$",
                        "次の中から多項式でないものを選べ：$① \\ 2x+1$",
                        "次の中から多項式でないものを選べ：$② \\ \\frac{1}{x}$",
                        "次の中から多項式でないものを選べ：$③ \\ \\frac{1}{2}x^2-3x$",
                        "次の中から多項式でないものを選べ：$④ \\ x^2$",
                        "次の多項式は、[x]に着目すると何次式か。また定数項をいえ：$ax^2 + x - 3$",
                        "次の多項式は、[a]に着目すると何次式か。また定数項をいえ：$ax^2 + x - 3$",
                        "次の多項式は、[x]に着目すると何次式か。また定数項をいえ：$x^2 - (a+b)x + ab$",
                        "次の多項式は、[x]に着目すると何次式か。また定数項をいえ：$5x^3 + 2x^2y - y^2 + 1$",
                        "次の多項式は、[y]に着目すると何次式か。また定数項をいえ：$5x^3 + 2x^2y - y^2 + 1$",
                        "次の多項式は、[x と y]に着目すると何次式か。また定数項をいえ：$5x^3 + 2x^2y - y^2 + 1$",
                        "次の多項式を $x$ について降べきの順に整理せよ：$2x^2 - 1 + 5x + x^4 - 3x^3$",
                        "次の多項式を $x$ について降べきの順に整理せよ：$2x^2 + xy + 3y^2 - 7x - 2y + 5$"
                    ],
                    "2. 多項式の加法と減法および乗法": [
                        "$A = 4x^3 - 3x^2 - 5x + 2, \\ B = -3x^3 + x^2 - 2x - 7$ について，$A+B$ と $A-B$ を計算せよ。",
                        "$A = 2x^3 - 1 - x^2, \\ B = -x^2 + 2x - 4x^3 + 1$ について，$A+B$ と $A-B$ を計算せよ。",
                        "$A = 5x^2 + 2xy - y^2, \\ B = -3x^2 + 4xy - 2y^2$ について，$A+B$ と $A-B$ を計算せよ。",
                        "$A = x^3 - 4x^2y + y^3, \\ B = -2x^2y + 3xy^2 + 3y^3, \\ C = xy^2 + y^3$ のとき，$A - 2(B - C) + 4C$ を計算せよ。",
                        "$A = 2x^2 + 3xy - y^2, \\ B = -3x^2 - xy + 2y^2, \\ C = -x^2 + xy + 3y^2$ のとき，$2(A - B) - (4A + B - C)$ を計算せよ。",
                        "次の計算をせよ：$2x^4 \\times 7x^2$",
                        "次の計算をせよ：$4a^5bc^2 \\times (-3a^4b^3c^2)$",
                        "次の計算をせよ：$(-2x^2y)^3 \\times (3xy^3)^2$",
                        "次の式を展開せよ：$3x^2(3x^2 - 5x + 2)$",
                        "次の式を展開せよ：$(x^2 - 2xy - 3y^2)(-xy^2)$",
                        "次の式を展開せよ：$(x^3 + 3x^2 - 4)(x - 2)$",
                        "次の式を展開せよ：$(x^3 - 3 + 4x^2)(2 + x^2)$",
                        "次の式を展開せよ：$(x + y)(x^2 - xy + 2y^2)$",
                        "次の式を展開せよ：$(2x - 3y + 1)(x + y - 2)$",
                        "次の式を展開せよ：$(2x + 3)^2$",
                        "次の式を展開せよ：$(2x - 5y)^2$",
                        "次の式を展開せよ：$(4x + 3)(4x - 3)$",
                        "次の式を展開せよ：$(x + 2)(x + 8)$",
                        "次の式を展開せよ：$(x - 4)(x - 3)$",
                        "次の式を展開せよ：$(x - 3y)(x + 5y)$",
                        "展開の公式4が成り立つことを，$(ax+b)(cx+d)$ を展開して確かめよ。",
                        "次の式を展開せよ：$(2x + 3)(6x + 5)$",
                        "次の式を展開せよ：$(5x + 2)(3x - 8)$",
                        "次の式を展開せよ：$(2x - y)(x + 3y)$",
                        "次の式を展開せよ：$(3x - a)(4x - 5a)$",
                        "$(a+b+c+d)(x+y+z)(p+q)$ を展開すると，いくつの項ができるか。",
                        "次の式を展開せよ：$(a + b + c)^2$",
                        "次の式を展開せよ：$(a + b - c)^2$",
                        "次の式を展開せよ：$(x - 2y + z)^2$",
                        "次の式を展開せよ：$(x + 1)^2(x - 1)^2$",
                        "次の式を展開せよ：$(a^2 + ab + b^2)(a^2 - ab + b^2)$",
                        "次の式を展開せよ：$(a + b)^2(a - b)^2$",
                        "次の式を展開せよ：$(x^2 + 1)(x + 1)(x - 1)$",
                        "次の式を展開せよ：$(x^2 + 2x + 3)(x^2 - 2x + 3)$",
                        "次の式を展開せよ：$(x - y + z)(x + y - z)$"
                    ],
                    "3. 因数分解": [
                        "次の式を因数分解せよ：$2x^2y - 6xy^2 + 10xyz$",
                        "次の式を因数分解せよ：$4xy^2z - x^2yz^2 + 2xyz$",
                        "次の式を因数分解せよ：$a(x - y) - bx + by$",
                        "次の式を因数分解せよ：$y(5x - 3) + 2(3 - 5x)$",
                        "次の式を因数分解せよ：$x^2 - 8x + 16$",
                        "次の式を因数分解せよ：$4x^2 + 28xy + 49y^2$",
                        "次の式を因数分解せよ：$9a^2 - 48ab + 64b^2$",
                        "次の式を因数分解せよ：$16x^2 - 25y^2$",
                        "次の式を因数分解せよ：$x^2 + 6x + 8$",
                        "次の式を因数分解せよ：$x^2 - 5xy + 6y^2$",
                        "次の式を因数分解せよ：$x^2 + xy - 12y^2$",
                        "次の式を因数分解せよ：$x^2 - 2ax - 15a^2$",
                        "次の式を因数分解せよ：$4x^2 + 8x - 21$",
                        "次の式を因数分解せよ：$4x^2 - 9xy + 2y^2$",
                        "次の式を因数分解せよ：$2x^2 + 3x + 1$",
                        "次の式を因数分解せよ：$4x^2 - 15x + 9$",
                        "次の式を因数分解せよ：$6x^2 - 5x - 6$",
                        "次の式を因数分解せよ：$3x^2 - 2xy - y^2$",
                        "次の式を因数分解せよ：$3a^2 - 14ab + 8b^2$",
                        "次の式を因数分解せよ：$4x^2 + 7ax - 2a^2$",
                        "次の式を因数分解せよ：$x^2 - y^2 - 2y - 1$",
                        "次の式を因数分解せよ：$x^2 - y^2 + 6y - 9$",
                        "次の式を因数分解せよ：$x^2 - 4x + 4 - 9y^2$",
                        "次の式を因数分解せよ：$x^4 - 8x^2 - 9$",
                        "次の式を因数分解せよ：$x^4 - 5x^2 + 4$",
                        "次の式を因数分解せよ：$x^4 - 81$",
                        "次の式を因数分解せよ：$(x^2 + 3x)^2 - 2(x^2 + 3x) - 8$",
                        "次の式を因数分解せよ：$x^3 + x^2y - x^2 - y$",
                        "次の式を因数分解せよ：$x^2 - yz + zx - y^2$",
                        "次の式を因数分解せよ：$9b - 9 - 3ab + a^2$",
                        "次の式を因数分解せよ：$2x^2 + 6xy + x - 3y - 1$",
                        "次の式を因数分解せよ：$2x^2 + 7xy + 6y^2 + 5x + 7y - 3$",
                        "次の式を因数分解せよ：$x^2 + 3xy + 2y^2 + 2x + 5y - 3$",
                        "次の式を因数分解せよ：$3x^2 - xy - 2y^2 + 6x - y + 3$",
                        "次の式を因数分解せよ：$a(b^2 - c^2) + b(c^2 - a^2) + c(a^2 - b^2)$",
                        "次の式を因数分解せよ：$ab(a - b) + bc(b - c) + ca(c - a)$",
                        "応用例題2の式を $y$ について降べきの順に整理して因数分解せよ。",
                        "次の式を展開せよ：$(x + 1)^3$",
                        "次の式を展開せよ：$(x - 2)^3$",
                        "次の式を展開せよ：$(3a + b)^3$",
                        "次の式を展開せよ：$(2x - 3y)^3$",
                        "展開の公式6が成り立つことを左辺を展開して確かめよ：$(a+b)(a^2-ab+b^2)=a^3+b^3$",
                        "展開の公式6が成り立つことを左辺を展開して確かめよ：$(a-b)(a^2+ab+b^2)=a^3-b^3$",
                        "次の式を展開せよ：$(x + 2)(x^2 - 2x + 4)$",
                        "次の式を展開せよ：$(x - 3)(x^2 + 3x + 9)$",
                        "次の式を展開せよ：$(3x + y)(9x^2 - 3xy + y^2)$",
                        "次の式を展開せよ：$(2a - 3b)(4a^2 + 6ab + 9b^2)$",
                        "次の式を因数分解せよ：$x^3 + 27$",
                        "次の式を因数分解せよ：$a^3 - 64$",
                        "次の式を因数分解せよ：$8x^3 - 125y^3$"
                    ],
                    "第1節 問題": [
                        "次の式を計算せよ：$(3x^2 - 2x - 4) + 2(x^3 - x + 2) - 3(x^2 - x + 4)$",
                        "次の式を計算せよ：$(x + y)^2 + (x - y)^2$",
                        "次の式を計算せよ：$(x + y)^2 - (x - y)^2$",
                        "次の式を展開せよ：$(5a + 8b)(2a - 7b)$",
                        "次の式を展開せよ：$(2x^2 - y)^2$",
                        "次の式を展開せよ：$(3a + b - 2c)^2$",
                        "次の式を展開せよ：$(x^2 - 2x - 1)(x^2 - 2x - 2)$",
                        "次の式を展開せよ：$(a - b)(a + b)(a^2 + b^2)$",
                        "次の式を展開せよ：$(x^4 + 1)(x^2 + 1)(x + 1)(x - 1)$",
                        "次の式を展開せよ：$(x - 4)(x - 1)(x + 1)(x + 4)$",
                        "次の式を展開せよ：$(x + 4)(x + 2)(x - 1)(x - 3)$",
                        "次の式を因数分解せよ：$3a^2 + 10a + 3$",
                        "次の式を因数分解せよ：$8x^2 - 51x + 18$",
                        "次の式を因数分解せよ：$15x^2 + 2xy - 24y^2$",
                        "次の式を因数分解せよ：$9x^2 - 30ax - 24a^2$",
                        "次の式を因数分解せよ：$2x^3 - 12x^2y + 18xy^2$",
                        "次の式を因数分解せよ：$4x^2 + y^2 - z^2 - 4xy$",
                        "次の式を因数分解せよ：$x^4 - 3x^2 - 4$",
                        "次の式を因数分解せよ：$(ac + bd)^2 - (ad + bc)^2$",
                        "次の式を因数分解せよ：$x^3 - 2x^2y + xy - 2y^2$",
                        "次の式を因数分解せよ：$x^2 + 2xy - 3y^2 - 5x + y + 4$",
                        "次の式を因数分解せよ：$2x^2 + 8ax + 6a^2 - x + a - 1$",
                        "次の式を因数分解せよ：$(a + b + c)(ab + bc + ca) - abc$",
                        "$(x + y + 2z)(2x + 3y - z)(4x - y - 3z)$ を展開したときの $xyz$ の項の係数を求めよ。",
                        "$(x^2 + 1)^2$ を展開せよ。",
                        "(1)の結果を利用して，$x^4 + x^2 + 1$ を因数分解せよ。"
                    ]
                },
                "第2節 実数": {
                    "4. 実数": [
                        "次の分数を小数で表せ（循環小数は点を用いて表せ）：$\\frac{1}{8}$",
                        "次の分数を小数で表せ（循環小数は点を用いて表せ）：$\\frac{8}{9}$",
                        "次の分数を小数で表せ（循環小数は点を用いて表せ）：$\\frac{7}{33}$",
                        "次の分数を小数で表せ（循環小数は点を用いて表せ）：$\\frac{55}{54}$",
                        "次の循環小数を分数で表せ：$0.\\dot{1}$",
                        "次の循環小数を分数で表せ：$0.\\dot{1}\\dot{2}$",
                        "次の循環小数を分数で表せ：$0.\\dot{6}4\\dot{8}$",
                        "次の循環小数を分数で表せ：$6.\\dot{2}\\dot{7}$",
                        "自然数、整数、有理数、実数の各範囲において、四則計算が常にできるか調べよ。",
                        "円周率 $\\pi$ の整数部分と小数部分を求めよ。",
                        "次の値を求めよ：$\\left|-\\frac{3}{4}\\right|$",
                        "次の値を求めよ：$|-5+3|$",
                        "次の値を求めよ：$|-5|+|3|$",
                        "次の値を求めよ：$|3-\\pi|$",
                        "次の2点間の距離を求めよ：$A(2), B(4)$",
                        "次の2点間の距離を求めよ：$A(-1), B(6)$",
                        "次の2点間の距離を求めよ：$A(-3), B(-7)$"
                    ],
                    "5. 根号を含む式の計算": [
                        "49 の平方根を求めよ。",
                        "$\\sqrt{25}$ の値を求めよ。",
                        "$(\\sqrt{7})^2$ の値を求めよ。",
                        "$(-\\sqrt{15})^2$ の値を求めよ。",
                        "実数 $a$ について，等式 $\\sqrt{a^2}=a$ が必ずしも成り立たないのは、$a$ がどのような数のときか説明せよ。",
                        "公式 $\\frac{\\sqrt{a}}{\\sqrt{b}}=\\sqrt{\\frac{a}{b}}$ を証明せよ。",
                        "公式 $\\sqrt{k^2a}=k\\sqrt{a}$ を証明せよ。",
                        "次の式を計算せよ：$4\\sqrt{3} + 5\\sqrt{3} - 7\\sqrt{3}$",
                        "次の式を計算せよ：$3\\sqrt{50} - 4\\sqrt{18} + \\sqrt{32}$",
                        "次の式を計算せよ：$(\\sqrt{7} + 2)(\\sqrt{7} - 2)$",
                        "次の式を計算せよ：$(4\\sqrt{2} - 3\\sqrt{3})(5\\sqrt{2} + 2\\sqrt{3})$",
                        "次の式を計算せよ：$(\\sqrt{3} + 2\\sqrt{6})^2$",
                        "次の式を計算せよ：$(3\\sqrt{2} - 2\\sqrt{7})^2$",
                        "$\\frac{2\\sqrt{3}+\\sqrt{2}}{\\sqrt{3}-\\sqrt{2}}$ の分母を有理化せよ。",
                        "次の式の分母を有理化せよ：$\\frac{18}{\\sqrt{6}}$",
                        "次の式の分母を有理化せよ：$\\frac{\\sqrt{3}}{2+\\sqrt{3}}$",
                        "次の式の分母を有理化せよ：$\\frac{\\sqrt{5}+\\sqrt{2}}{\\sqrt{5}-\\sqrt{2}}$",
                        "次の式の分母を有理化せよ：$\\frac{3\\sqrt{7}-\\sqrt{3}}{\\sqrt{7}+\\sqrt{3}}$",
                        "$x = \\frac{2}{\\sqrt{5}+\\sqrt{3}}, \\ y = \\frac{2}{\\sqrt{5}-\\sqrt{3}}$ のとき，$x + y$ の値を求めよ。",
                        "$x = \\frac{2}{\\sqrt{5}+\\sqrt{3}}, \\ y = \\frac{2}{\\sqrt{5}-\\sqrt{3}}$ のとき，$xy$ の値を求めよ。",
                        "$x = \\frac{2}{\\sqrt{5}+\\sqrt{3}}, \\ y = \\frac{2}{\\sqrt{5}-\\sqrt{3}}$ のとき，$x^2 + y^2$ の値を求めよ。",
                        "$x = \\frac{1}{\\sqrt{7}+\\sqrt{5}}, \\ y = \\frac{1}{\\sqrt{7}-\\sqrt{5}}$ のとき，$x + y$ の値を求めよ。",
                        "$x = \\frac{1}{\\sqrt{7}+\\sqrt{5}}, \\ y = \\frac{1}{\\sqrt{7}-\\sqrt{5}}$ のとき，$xy$ の値を求めよ。",
                        "$x = \\frac{1}{\\sqrt{7}+\\sqrt{5}}, \\ y = \\frac{1}{\\sqrt{7}-\\sqrt{5}}$ のとき，$x^2 + y^2$ の値を求めよ。",
                        "$x = \\frac{1}{\\sqrt{7}+\\sqrt{5}}, \\ y = \\frac{1}{\\sqrt{7}-\\sqrt{5}}$ のとき，$x^2y + xy^2$ の値を求めよ。",
                        "$x = \\frac{1}{\\sqrt{2}+1}, \\ y = \\frac{1}{\\sqrt{2}-1}$ のとき，$x^2 + y^2$ の値を求めよ。",
                        "$x = \\frac{1}{\\sqrt{2}+1}, \\ y = \\frac{1}{\\sqrt{2}-1}$ のとき，$x^3 + y^3$ の値を求めよ。",
                        "$x = \\frac{1}{\\sqrt{2}+1}, \\ y = \\frac{1}{\\sqrt{2}-1}$ のとき，$x^3y - x^2y^2 + xy^3$ の値を求めよ。",
                        "次の式の2重根号をはずして簡単にせよ：$\\sqrt{7 + 2\\sqrt{10}}$",
                        "次の式の2重根号をはずして簡単にせよ：$\\sqrt{12 - 6\\sqrt{3}}$",
                        "次の式の2重根号をはずして簡単にせよ：$\\sqrt{3 + \\sqrt{5}}$"
                    ],
                    "第2節 問題": [
                        "次の循環小数を分数で表せ：$0.\\dot{5}$",
                        "次の循環小数を分数で表せ：$3.\\dot{2}\\dot{5}$",
                        "次の循環小数を分数で表せ：$0.12\\dot{3}\\dot{4}$",
                        "次の循環小数を分数で表せ：$0.3\\dot{2}\\dot{1}$",
                        "$a = 3$ のとき $|a-1|+|a+2|$ の値を求めよ。",
                        "$a = 0$ のとき $|a-1|+|a+2|$ の値を求めよ。",
                        "$a = -1$ のとき $|a-1|+|a+2|$ の値を求めよ。",
                        "$a = -\\sqrt{3}$ のとき $|a-1|+|a+2|$ の値を求めよ。",
                        "次の式を計算せよ：$2\\sqrt{5} + \\sqrt{45} - \\sqrt{125}$",
                        "次の式を計算せよ：$\\sqrt{48} + \\sqrt{32} - \\sqrt{27} - \\sqrt{50}$",
                        "次の式を計算せよ：$(2\\sqrt{3} - 5\\sqrt{2})(3\\sqrt{2} + \\sqrt{3})$",
                        "次の式を計算せよ：$(2\\sqrt{6} - \\sqrt{18})(\\sqrt{6} + 3\\sqrt{8})$",
                        "次の式を計算せよ：$(1 + \\sqrt{2} + \\sqrt{3})^2$",
                        "次の式を計算せよ：$(2 - \\sqrt{3} + \\sqrt{7})(2 - \\sqrt{3} - \\sqrt{7})$",
                        "次の式を計算せよ：$\\frac{\\sqrt{5}}{\\sqrt{3}-1} - \\frac{\\sqrt{3}}{\\sqrt{5}+\\sqrt{3}}$",
                        "次の式を計算せよ：$\\frac{\\sqrt{7}+1}{\\sqrt{7}-\\sqrt{3}} - \\frac{\\sqrt{7}-1}{\\sqrt{7}+\\sqrt{3}}$",
                        "次の式を計算せよ：$\\frac{1}{1+\\sqrt{2}} + \\frac{1}{\\sqrt{2}+\\sqrt{3}} + \\frac{1}{\\sqrt{3}+2}$",
                        "$x = \\frac{\\sqrt{5}-1}{\\sqrt{5}+1}, \\ y = \\frac{\\sqrt{5}+1}{\\sqrt{5}-1}$ のとき $x^2 + y^2$ を求めよ。",
                        "$x = \\frac{\\sqrt{5}-1}{\\sqrt{5}+1}, \\ y = \\frac{\\sqrt{5}+1}{\\sqrt{5}-1}$ のとき $x^2 - y^2$ を求めよ。",
                        "$\\frac{1}{37}$ を小数で表したとき，小数第100位の数字を求めよ。",
                        "誤りである計算の等号 ①〜⑥ の中で誤っているものをすべてあげ，理由を述べよ。",
                        "次の実数の整数部分と小数部分を求めよ：$\\sqrt{3}$",
                        "次の実数の整数部分と小数部分を求めよ：$\\sqrt{10}$",
                        "次の実数の整数部分と小数部分を求めよ：$\\frac{2}{\\sqrt{3}-1}$"
                    ]
                },
                "第3節 1次不等式": {
                    "6. 1次不等式": [
                        "ある数 $x$ に8を加えた数は，$x$ の3倍より大きい。これを不等式で表せ。",
                        "ある数 $x$ を2で割って5を引いた数は，-4以上0以下である。これを不等式で表せ。",
                        "2数 $a, b$ の和は負で，-3以上である。これを不等式で表せ。",
                        "$a < b$ のとき $3a < 3b$ となることを数直線を用いて確かめよ ($a<0, b>0$)。",
                        "$a < b$ のとき $-3a > -3b$ となることを数直線を用いて確かめよ ($a<0, b<0$)。",
                        "$a < b$ のとき，$\\frac{a}{3}$ と $\\frac{b}{3}$ に適する不等号を入れよ。",
                        "$a < b$ のとき，$\\frac{a}{-3}$ と $\\frac{b}{-3}$ に適する不等号を入れよ。",
                        "$a < b$ のとき， $a - 2$ と $b - 2$ に適する不等号を入れよ。",
                        "$a < b$ のとき， $-5a$ と $-5b$ に適する不等号を入れよ。",
                        "$a < b$ のとき， $-\\frac{a}{8}$ と $-\\frac{b}{8}$ に適する不等号を入れよ。",
                        "$a < b$ のとき， $1 - a$ と $1 - b$ に適する不等号を入れよ。",
                        "次の不等式を解け：$5x - 8 \\le 22$",
                        "次の不等式を解け：$4x + 15 \\ge 3$",
                        "次の不等式を解け：$-6x + 5 > 29$",
                        "次の1次不等式を解け：$3x - 1 \\le 9x - 7$",
                        "次の1次不等式を解け：$\\frac{3}{2}x + 1 > \\frac{1}{3}(x - 1)$",
                        "次の1次不等式を解け：$3x + 6 > 16 - 2x$",
                        "次の1次不等式を解け：$4x - 7 \\le 7x + 8$",
                        "次の1次不等式を解け：$5(3x - 1) \\ge 8x + 1$",
                        "次の1次不等式を解け：$3(x - 2) > 2(5x - 3)$",
                        "次の1次不等式を解け：$\\frac{3}{4}x - \\frac{2}{3} < \\frac{1}{2}(x - 2)$",
                        "次の1次不等式を解け：$0.3x + 0.4 \\ge 0.8 - 0.1x$",
                        "連立不等式 $\\begin{cases} 7x - 1 \\ge 4x - 7 \\\\ x + 5 > 3(1 + x) \\end{cases}$ を解け。",
                        "次の連立不等式を解け：$\\begin{cases} 2x + 7 \\ge 4x - 3 \\\\ 3x + 5 > -2x \\end{cases}$",
                        "次の連立不等式を解け：$\\begin{cases} 4x + 1 < 3x - 1 \\\\ 2x - 1 \\ge 5x + 6 \\end{cases}$",
                        "次の連立不等式を解け：$\\begin{cases} x - 2 \\ge 4x - 5 \\\\ 3(x - 1) > 2x \\end{cases}$",
                        "不等式 $5x - 6 \\le x + 1 < 2x$ を解け。"
                    ],
                    "7. 1次不等式の利用": [
                        "品物A(500円)と品物B(700円)を合わせて50個買い送料1500円込で30000円以下にする時，品物Bは最大何個買えるか。",
                        "菓子A(200円)と菓子B(100円)を合わせて20個買い，箱代120円込で3000円以下にする時，菓子Aは最大何個買えるか。",
                        "家から駅まで2400m。初め分速150mで走り途中から分速60mで歩き30分以内に着くには，走る道のりを何m以上にしなければならないか。",
                        "次の方程式・不等式を解け：$|x| = 4$",
                        "次の方程式・不等式を解け：$|x| < 2$",
                        "次の方程式・不等式を解け：$|x| \\ge 5$",
                        "次の方程式・不等式を解け：$|2x - 1| = 3$",
                        "次の方程式・不等式を解け：$|2x - 1| < 3$",
                        "次の方程式・不等式を解け：$|3x - 4| = 2$",
                        "次の方程式・不等式を解け：$|x - 2| \\le 3$",
                        "次の方程式・不等式を解け：$|2x + 1| > 1$"
                    ],
                    "第3節 問題": [
                        "次の1次不等式を解け：$7(x + 2) + 2(3 - x) < 0$",
                        "次の1次不等式を解け：$2(x - 5) - 3(2x - 3) \\ge 0$",
                        "次の1次不等式を解け：$\\frac{2x + 1}{3} - \\frac{x - 1}{4} > 1$",
                        "次の1次不等式を解け：$3 + \\frac{4 - 2x}{3} > \\frac{3}{2}x + \\frac{5}{6}$",
                        "$x$ が負の整数のとき，不等式 $3x - 5 < 7(x + 1) + 4$ を満たす $x$ の値をすべて求めよ。",
                        "シャツ1枚通常220円。1000円払って会員になると1年間5%引き。1年間に何枚以上で会員が得になるか。",
                        "次の不等式を解け：$\\begin{cases} x - 5 < 4x + 2 \\\\ \\frac{x - 1}{2} \\le \\frac{3x + 1}{4} - x \\end{cases}$",
                        "次の不等式を解け：$\\begin{cases} 2x + 3 > x + 2 \\\\ 3x > 4x + 2 \\end{cases}$",
                        "次の不等式を解け：$\\frac{x + 9}{3} \\ge 2 - x > \\frac{3}{2}x + \\frac{11}{3}$",
                        "次の方程式・不等式を解け：$|3x - 2| = 10$",
                        "次の方程式・不等式を解け：$|2x + 5| > 1$",
                        "次の方程式・不等式を解け：$|5x - 3| \\le 12$",
                        "不等式 $2 \\le |x - 3| < 5$ を解け。",
                        "連立不等式 $\\begin{cases} 5x - 8 \\ge 7x - 2 \\\\ 2x + a \\le 3x + 9 \\end{cases}$ の解が $x = -3$ となる $a$ の値を求めよ。"
                    ]
                },
                "第1章 演習問題": [
                    "次の式を展開し $x$ について降べきの順に整理せよ：$(x - a)(x - b)(x - c)$",
                    "次の式を展開し $x$ について降べきの順に整理せよ：$(x - 1)(x - 3)(x^2 - 4x)$",
                    "次の式を展開し $x$ について降べきの順に整理せよ：$(x + 1)(x + 2)(x - 5)(x - 6)$",
                    "次の式を展開し $x$ について降べきの順に整理せよ：$(x - 2)^2(x + 2)^2(x^2 + 4)^2$",
                    "次の式を因数分解せよ：$6(x + y)^2 - (x + y) - 2$",
                    "次の式を因数分解せよ：$3x^2 + x(y - z) - 2(y - z)^2$",
                    "次の式を因数分解せよ：$(x - y)(x - y - 2) - 8$",
                    "次の式を因数分解せよ：$(2x + 2y + 1)(x + y + 1) - 10$",
                    "$x \\ge 1$ のとき $\\sqrt{(x-1)^2}$ を簡約せよ。",
                    "$x < 1$ のとき $\\sqrt{(x-1)^2}$ を簡約せよ。",
                    "$-1 \\le x < 1$ のとき $\\sqrt{x^2+2x+1} - \\sqrt{x^2-2x+1}$ を簡約せよ。",
                    "$x = \\frac{3 - \\sqrt{5}}{2}$ のとき $x + \\frac{1}{x}$ を求めよ。",
                    "$x = \\frac{3 - \\sqrt{5}}{2}$ のとき $x^2 + \\frac{1}{x^2}$ を求めよ。",
                    "$x = \\frac{3 - \\sqrt{5}}{2}$ のとき $x^2 - \\frac{1}{x^2}$ を求めよ。",
                    "$x = \\frac{3 - \\sqrt{5}}{2}$ のとき $x^4 + \\frac{1}{x^4}$ を求めよ。",
                    "$x = \\frac{3 - \\sqrt{5}}{2}$ のとき $x^4 - \\frac{1}{x^4}$ を求めよ。",
                    "次の連立不等式を解け：$\\begin{cases} (1 - \\sqrt{2})x > -1 \\\\ |2x + 1| < 6 \\end{cases}$",
                    "定数 $a$ について次の不等式を解け：$ax \\le 3$",
                    "定数 $a$ について次の不等式を解け：$ax + 8 < 4x + 2a$",
                    "次の式を計算せよ：$(a + b + c + d)(a + b - c - d)$",
                    "次の式を計算せよ：$(a + b + c)^2 - (a - b - c)^2$",
                    "次の式を因数分解せよ：$2x^2 + y^2 + 3xy + x + 2y - 3$",
                    "次の式を因数分解せよ：$(x + 2y - 2z)(x + 2y - 3z) - 12z^2$",
                    "次の式を因数分解せよ：$x^2 + y^2 - 3z^2 + 2xy + 2yz + 2zx$",
                    "$x + y + z = 2, \\ xy + yz + zx = -1$ のとき $x^2 + y^2 + z^2$ を求めよ。",
                    "$(1 + \\sqrt{2} + \\sqrt{3})(1 + \\sqrt{2} - \\sqrt{3})$ を計算せよ。",
                    "$\\frac{1}{1 + \\sqrt{2} + \\sqrt{3}}$ の分母を有理化せよ。",
                    "$\\frac{1}{\\sqrt{5}-2}$ の整数部分 $a$ と小数部分 $b$ を求めよ ($a$)",
                    "$\\frac{1}{\\sqrt{5}-2}$ の整数部分 $a$ と小数部分 $b$ を求めよ ($b$)",
                    "$b^3$ の値を求めよ。",
                    "$b^4 - 2b^2 + 1$ の値を求めよ。",
                    "方程式 $|x| + 2|x - 2| = x + 2$ を解け。",
                    "不等式 $|2x - 3| \\le a$ の解を求めよ。",
                    "$a = 4$ のとき，不等式を満たす整数 $x$ は何個か。",
                    "整数 $x$ がちょうど6個存在するような $a$ の値の範囲を求めよ。"
                ]
            },
            "第2章 集合と命題": {
                "1. 集合": [
                    "3 と $Q$ の関係を $\\in$ または $\\notin$ で表せ。",
                    "$\\sqrt{2}$ と $Q$ の関係を $\\in$ または $\\notin$ で表せ。",
                    "$-\\frac{3}{2}$ と $Q$ の関係を $\\in$ または $\\notin$ で表せ。",
                    "18の正の約数全体の集合 $F$ を要素を書き並べて表せ。",
                    "$G = \\{x \\mid -2 \\le x < 3, x \\text{は整数\\}}$ を要素を書き並べて表せ。",
                    "$H = \\{2n + 1 \\mid n = 0, 1, 2, 3, \\dots\\}$ を要素を書き並べて表せ。",
                    "$A = \\{1, 2, 4, 8\\}$ と $B = \\{x \\mid x \\text{は4の正の約数\\}}$ の関係を $\\subset, =$ で表せ。",
                    "$A = \\{1, 2, 4, 8\\}$ と $C = \\{x \\mid x \\text{は8の正の約数\\}}$ の関係を $\\subset, =$ で表せ。",
                    "$A = \\{1, 2, 4, 8\\}$ と $D = \\{x \\mid x \\text{は24の正の約数\\}}$ の関係を $\\subset, =$ で表せ。",
                    "集合 $\\{1, 2, 3\\}$ の部分集合をすべて求めよ。",
                    "$A = \\{1, 3, 5, 7, 9, 11, 13, 15\\}, \\ B = \\{5, 10, 15\\}$ について $A \\cap B$ と $A \\cup B$ を求めよ。",
                    "$A = \\{x \\mid -2 \\le x \\le 2\\}, \\ B = \\{x \\mid -1 < x < 3\\}$ について $A \\cap B$ と $A \\cup B$ を求めよ。",
                    "$A = \\{2, 3, 5, 7, 11\\}, B = \\{1, 3, 5, 7\\}, C = \\{1, 2, 3, 4, 5\\}$ について $A \\cap B \\cap C$ と $A \\cup B \\cup C$ を求めよ。",
                    "$A = \\{1, 2, 3, 4, 5, 6, 7\\}, B = \\{1, 2, 3, 4, 6, 12\\}, C = \\{1, 2, 3, 6, 9, 18\\}$ について $A \\cap B \\cap C$ と $A \\cup B \\cup C$ を求めよ。",
                    "全体集合 $U = \\{1..9\\}, A = \\{2, 3, 5, 7\\}, B = \\{3, 4, 5\\}$ のとき $\\overline{A}$ を求めよ。",
                    "全体集合 $U = \\{1..9\\}, A = \\{2, 3, 5, 7\\}, B = \\{3, 4, 5\\}$ のとき $\\overline{B}$ を求めよ。",
                    "全体集合 $U = \\{1..9\\}, A = \\{2, 3, 5, 7\\}, B = \\{3, 4, 5\\}$ のとき $A \\cap B$ を求めよ。",
                    "全体集合 $U = \\{1..9\\}, A = \\{2, 3, 5, 7\\}, B = \\{3, 4, 5\\}$ のとき $A \\cup B$ を求めよ。",
                    "全体集合 $U = \\{1..9\\}, A = \\{2, 3, 5, 7\\}, B = \\{3, 4, 5\\}$ のとき $\\overline{A} \\cap B$ を求めよ。",
                    "全体集合 $U = \\{1..9\\}, A = \\{2, 3, 5, 7\\}, B = \\{3, 4, 5\\}$ のとき $A \\cap \\overline{B}$ を求めよ。",
                    "全体集合 $U = \\{1..9\\}, A = \\{2, 3, 5, 7\\}, B = \\{3, 4, 5\\}$ のとき $\\overline{A \\cup B}$ を求めよ。",
                    "全体集合 $U = \\{1..9\\}, A = \\{2, 3, 5, 7\\}, B = \\{3, 4, 5\\}$ のとき $\\overline{A \\cap B}$ を求めよ。"
                ],
                "2. 命題と条件": [
                    "次の命題の真偽を述べよ：$x^2 = 4 \\Rightarrow x = 2$",
                    "次の命題の真偽を述べよ：$x = y \\Rightarrow x^2 = y^2$",
                    "次の命題の真偽を述べよ：長方形は平行四辺形である。",
                    "$x$ は実数。$-1 < x < 2 \\Rightarrow x > -2$ の真偽を調べよ。",
                    "$x$ は実数。$x < 2 \\Rightarrow -1 < x < 2$ の真偽を調べよ。",
                    "$n$ は自然数。「$n$ は素数 $\\Rightarrow n$ は奇数」が偽であることを示せ。",
                    "$x = 2$ は $x^2 = 2x$ であるためのどのような条件か。",
                    "$x > 0$ は $x > 1$ であるためのどのような条件か。",
                    "2つの三角形の面積が等しいことは、合同であるためのどのような条件か。",
                    "$AB^2 + BC^2 = CA^2$ は $\\angle B = 90^\\circ$ の直角三角形であるためのどのような条件か。",
                    "次の条件の否定を述べよ：$x \\le -3$",
                    "次の条件の否定を述べよ：$x + y > 0$",
                    "次の条件の否定を述べよ：$x$ は無理数である",
                    "次の条件の否定を述べよ：$x \\neq 0$ かつ $y \\neq 0$",
                    "次の条件の否定を述べよ：$x \\le 2$ または $x \\le 5$",
                    "次の条件の否定を述べよ：$x, y$ の少なくとも一方は有理数である"
                ],
                "3. 命題と証明": [
                    "$x = 0 \\Rightarrow xy = 0$ の真偽，および逆・対偶・裏の真偽を調べよ。",
                    "$xy > 0 \\Rightarrow x > 0$ かつ $y > 0$ の真偽，および逆・対偶・裏の真偽を調べよ。",
                    "$n$ は整数。$n^2$ が偶数ならば $n$ は偶数であることを証明せよ。",
                    "$n$ は整数。$n^2$ が奇数ならば $n$ は奇数であることを証明せよ。",
                    "$x, y$ は実数。$x + y > 0 \\Rightarrow x > 0$ または $y > 0$ を証明せよ。",
                    "$\\sqrt{2}$ が無理数であることを用いて $1 + 2\\sqrt{2}$ が無理数であることを証明せよ。",
                    "円周率 $\\pi$ が無理数であることを用いて $\\sqrt{\\pi}$ が無理数であることを証明せよ。",
                    "$\\sqrt{2}$ が無理数であることを証明せよ。",
                    "$\\sqrt{3}$ が無理数であることを証明せよ。",
                    "すべての実数 $x$ について $x + 1 > 0$ の否定を述べ，真偽を調べよ。",
                    "ある素数 $n$ について $n + 2$ は素数であるの否定を述べ，真偽を調べよ。"
                ],
                "第2章 問題": [
                    "全体集合 $U$ (1桁の自然数), $A=\\{2,3,5,8\\}, B=\\{5,6,7\\}, C=\\{3,5,6,9\\}$ について $\\overline{A \\cup B}$ を求めよ。",
                    "同上の集合について $\\overline{A} \\cup \\overline{B}$ を求めよ。",
                    "同上の集合について $\\overline{A} \\cap B$ を求めよ。",
                    "同上の集合について $A \\cap B \\cap C$ を求めよ。",
                    "同上の集合について $A \\cup B \\cup C$ を求めよ。",
                    "同上の集合について $A \\cap B \\cap \\overline{C}$ を求めよ。",
                    "$\\triangle ABC$ が二等辺三角形であることは正三角形であるためのどのような条件か。",
                    "$x = y$ は $x^2 + y^2 = 2xy$ であるためのどのような条件か。",
                    "$x + y > 2$ は $x > 1$ または $y > 1$ であるためのどのような条件か。",
                    "整数 $n$ について，$n^2$ が3の倍数ならば $n$ は3の倍数であることを証明せよ。",
                    "$a, b$ は有理数。$a + b\\sqrt{2} = 0 \\Rightarrow a = b = 0$ を証明せよ。",
                    "$a + b\\sqrt{2} = -1 + 3\\sqrt{2}$ を満たす有理数 $a, b$ の値を求めよ。"
                ],
                "第2章 演習問題": [
                    "$A=\\{2, 6, a^2+3\\}, B=\\{3, 7, a, a+4\\}, A \\cap B = \\{2, 7\\}$ のとき定数 $a$ の値を求めよ。",
                    "同上の条件で $A \\cup B$ を求めよ。",
                    "同上の条件で $\\overline{A} \\cap B$ を求めよ。",
                    "12で割り切れる自然数 $P$ と15で割り切れる $Q$ について「3でも4でも割り切れる」を $P, Q$ で表せ。",
                    "同上の条件で「60で割り切れる」を $P, Q$ で表せ。",
                    "同上の条件で「15で割り切れるが4では割り切れない」を $P, Q$ で表せ。",
                    "$p: m+n$ は偶数，$q: mn$ は偶数，$r: m, n$ はともに偶数。$p$ は $r$ のためのどのような条件か。",
                    "$q$ は $r$ のためのどのような条件か。",
                    "$p$ かつ $q$ は $r$ のためのどのような条件か。",
                    "$p$ または $q$ は $r$ のためのどのような条件か。",
                    "$x^2 - y^2 = 1$ を満たす自然数 $x, y$ は存在しないことを証明せよ。",
                    "実数 $a, b$ について「ともに無理数 $\\Rightarrow a+b$ は無理数」の真偽を調べよ。",
                    "実数 $a, b$ について「ともに無理数 $\\Rightarrow a+b, a-b$ の少なくとも一方は無理数」の真偽を調べよ。",
                    "実数 $a, b$ について「ともに無理数 $\\Rightarrow a+b, ab$ の少なくとも一方は無理数」の真偽を調べよ。",
                    "整数 $a, b, c$ が $a^2 + b^2 = c^2$ を満たすとき $a, b, c$ のうち少なくとも1つは偶数であることを証明せよ。"
                ]
            },
            "第3章 2次関数": {
                "第1節 2次関数とグラフ": [
                    "$f(x) = -3x + 5$ について $f(0)$ を求めよ。",
                    "$f(x) = -3x + 5$ について $f(2)$ を求めよ。",
                    "$f(x) = -3x + 5$ について $f(-1)$ を求めよ。",
                    "$f(x) = -3x + 5$ について $f(a+1)$ を求めよ。",
                    "点 $(3, 5)$ は第何象限か。",
                    "点 $(4, -1)$ は第何象限か。",
                    "点 $(-2, -3)$ は第何象限か。",
                    "点 $(-5, 2)$ は第何象限か。",
                    "関数 $y = 3x - 1$ のグラフをかけ。",
                    "関数 $y = -x^2$ のグラフをかけ。",
                    "関数 $y = -2x + 5 \\ (-1 < x \\le 3)$ のグラフをかき値域を求めよ。",
                    "関数 $y = -3x + 2 \\ (-2 \\le x \\le 3)$ のグラフをかき値域を求めよ。",
                    "関数 $y = 2x - 3 \\ (0 < x < 3)$ のグラフをかき値域を求めよ。",
                    "関数 $y = 2x - 7 \\ (1 < x \\le 4)$ の最大値・最小値を求めよ。",
                    "関数 $y = x + 2 \\ (-4 \\le x \\le 2)$ の最大値・最小値を求めよ。",
                    "関数 $y = -x - 5 \\ (-3 \\le x \\le 1)$ の最大値・最小値を求めよ。",
                    "関数 $y = -\\frac{1}{2}x + 5 \\ (0 \\le x < 2)$ の最大値・最小値を求めよ。",
                    "関数 $y = 3x - 2 \\ (x > 1)$ の最大値・最小値を求めよ。",
                    "次の2次関数のグラフをかき，上に凸か下に凸か答えよ：$y = 3x^2$",
                    "次の2次関数のグラフをかき，上に凸か下に凸か答えよ：$y = -4x^2$",
                    "次の2次関数のグラフをかき，上に凸か下に凸か答えよ：$y = \\frac{1}{3}x^2$",
                    "点 $(1, 2)$ を $x$ 軸方向に-3，$y$ 軸方向に2だけ移動した点の座標を求めよ。",
                    "点 $(4, -1)$ を $x$ 軸方向に-3，$y$ 軸方向に2だけ移動した点の座標を求めよ。",
                    "2次関数 $y = x^2 + 1$ のグラフの軸と頂点を求めよ。",
                    "2次関数 $y = 2x^2 - 3$ のグラフの軸と頂点を求めよ。",
                    "2次関数 $y = -x^2 + 2$ のグラフの軸と頂点を求めよ。",
                    "2次関数 $y = (x - 1)^2$ のグラフの軸と頂点を求めよ。",
                    "2次関数 $y = -2(x + 2)^2$ のグラフの軸と頂点を求めよ。",
                    "2次関数 $y = \\frac{1}{2}(x + 3)^2$ のグラフの軸と頂点を求めよ。",
                    "次の2次式を平方完成せよ：$x^2 - 4x + 5$",
                    "次の2次式を平方完成せよ：$2x^2 + 8x + 7$",
                    "次の2次式を平方完成せよ：$x^2 - x - 2$",
                    "次の2次式を平方完成せよ：$2x^2 + 6x - 1$",
                    "2次関数 $y = -2x^2 - 8x - 3$ のグラフの軸と頂点を求めよ。",
                    "放物線 $y = x^2 + 2x + 2$ はどのように平行移動すると $y = x^2 - 4x + 1$ に重なるか。",
                    "放物線 $y = -x^2 - 10x - 25$ はどのように平行移動すると $y = -x^2 + 8x - 23$ に重なるか。",
                    "放物線 $y = x^2 - 2x + 3$ を $x$ 軸方向に2，$y$ 軸方向に-3だけ平行移動して得られる放物線の方程式を求めよ。",
                    "次の2次関数に最大値・最小値があれば求めよ：$y = -x^2 - 4x - 1$",
                    "次の2次関数に最大値・最小値があれば求めよ：$y = x^2 + 4x + 2$",
                    "次の2次関数に最大値・最小値があれば求めよ：$y = -x^2 + 6x - 4$",
                    "関数 $y = x^2 - 2x + 2 \\ (0 \\le x \\le 3)$ の最大値と最小値を求めよ。",
                    "関数 $y = x^2 + 2x + c \\ (-2 \\le x \\le 2)$ の最大値が5であるときの $c$ の値を定めよ。",
                    "$a$ は正の定数。関数 $y = x^2 - 4x + 1 \\ (0 \\le x \\le a)$ の最小値を求めよ。",
                    "頂点が $(1, 2)$ で点 $(3, 6)$ を通る2次関数を求めよ。",
                    "軸が直線 $x = -1$ で2点 $(1, 3), (-2, -3)$ を通る2次関数を求めよ。"
                ],
                "第2節 2次方程式と2次不等式": [
                    "2次方程式 $x^2 - 2x - 3 = 0$ を解け。",
                    "次の2次方程式を解け：$x^2 - 6x + 5 = 0$",
                    "次の2次方程式を解け：$x^2 - 5x - 24 = 0$",
                    "次の2次方程式を解け：$2x^2 + 5x + 2 = 0$",
                    "次の2次方程式を解け：$3x^2 + 7x - 6 = 0$",
                    "次の2次方程式を解け：$3x^2 - 9x + 2 = 0$",
                    "次の2次方程式を解け：$5x^2 + 6x - 1 = 0$",
                    "2次方程式 $x^2 - 6x + 3 = 0$ の実数解の個数を求めよ。",
                    "2次方程式 $x^2 - 6x + m = 0$ が異なる2つの実数解をもつ $m$ の値の範囲を求めよ。",
                    "2次方程式 $x^2 - mx + 2 = 0$ が重解をもつ $m$ の値と重解を求めよ。",
                    "2次関数 $y = 2x^2 + x - 1$ のグラフと $x$ 軸の共一点の座標を求めよ。",
                    "次の2次不等式を解け：$(x - 3)(x - 5) > 0$",
                    "次の2次不等式を解け：$(x + 3)(x - 2) \\le 0$",
                    "次の2次不等式を解け：$x^2 - 7x + 12 < 0$",
                    "次の2次不等式を解け：$x^2 + 3x - 4 \\ge 0$",
                    "次の2次不等式を解け：$3x^2 + 4x - 4 \\le 0$",
                    "次の2次不等式を解け：$x^2 - 2x - 2 > 0$",
                    "2次不等式 $-x^2 + 3x - 2 < 0$ を解け。",
                    "2次不等式 $x^2 + mx + m + 3 > 0$ の解がすべての実数であるとき $m$ の値の範囲を求めよ。",
                    "連立不等式 $\\begin{cases} x^2 - 4x > 0 \\\\ x^2 - x - 12 \\le 0 \\end{cases}$ を解け。"
                ]
            }
        },
        "数Ⅱ": {
            "第1章 式と証明": {
                "1. 式の計算": [
                    "次の式を展開せよ：$(2xy+1)^3$",
                    "次の式を展開せよ：$(a-b)^2(a^2+ab+b^2)^2$",
                    "次の式を因数分解せよ：$x^3+y^3z^3$",
                    "次の式を因数分解せよ：$(x+y)^3-1$",
                    "次の式を因数分解せよ：$a^3-9a^2+27a-27$",
                    "次の式の展開式における，[ ]内に指定された項の係数を求めよ：$(2x^2-3)^6 \\quad [x^2]$",
                    "次の式の展開式における，[ ]内に指定された項の係数を求めよ：$(x-3y-z)^5 \\quad [x^2yz^2]$",
                    "次の多項式 $A$, $B$ について，$A$ を $B$ で割った商と余りを求めよ：$A=4x^3+4x^2-7x-2, \\quad B=2x^2-3x+1$",
                    "次の多項式 $A$, $B$ について，$A$ を $B$ で割った商と余りを求めよ：$A=2x^3-3x^2+2x-8, \\quad B=2x-1$",
                    "ある多項式を $x^2-x-3$ で割ると，商が $3x+1$，余りが $5x+4$ である。この多項式を求めよ。",
                    "次の式を計算せよ：$\\frac{x^2+2x-3}{x^2-x} \\times \\frac{x^2-2x}{x^2+x-6}$",
                    "次の式を計算せよ：$\\frac{9x^2-4y^2}{6x^2+xy-2y^2} \\div \\frac{6x^2-xy-2y^2}{4x^2-4xy+y^2}$",
                    "次の式を計算せよ：$\\frac{x-3}{x^2+3x+2} - \\frac{x-4}{x^2+2x+1}$",
                    "次の式を計算せよ：$\\frac{2}{4x^2-1} + \\frac{3x}{2x^2-x-1}$",
                    "次の等式が $x$ についての恒等式となるように，定数 $a, b, c$ の値を定めよ：$ax(x+1)+bx(x-1)+c(x-1)(x-3)=x^2+3$",
                    "次の等式が $x$ についての恒等式となるように，定数 $a, b, c$ の値を定めよ：$x^3+ax+2=(x-1)(x^2+bx+c)$",
                    "次の等式が $x$ についての恒等式となるように，定数 $a, b, c$ の値を定めよ：$\\frac{1}{x^3+1}=\\frac{a}{x+1}+\\frac{bx+c}{x^2-x+1}$",
                    "次の $\\Box$ に入る数を，二項定理を用いて求めよ：${}_{99}\\text{C}_0 + {}_{99}\\text{C}_1 + {}_{99}\\text{C}_2 + \\dots + {}_{99}\\text{C}_{49} = 2^{\\Box}$"
                ],
                "2. 等式と不等式の証明": [
                    "次の等式を証明せよ：$x^3+\\frac{1}{x^3}=\\left(x+\\frac{1}{x}\\right)^3-3\\left(x+\\frac{1}{x}\\right)$",
                    "次の等式を証明せよ：$x^3-\\frac{1}{x^3}=\\left(x-\\frac{1}{x}\\right)^3+3\\left(x-\\frac{1}{x}\\right)$",
                    "$a+b+c=0$ のとき，次の等式が成り立つことを証明せよ：$(b+c)^2+(c+a)^2+(a+b)^2+2(bc+ca+ab)=0$",
                    "$\\frac{x}{a}=\\frac{y}{b}=\\frac{z}{c}$ のとき，次の等式が成り立つことを証明せよ：$\\frac{x+2y+3z}{a+2b+3c}=\\frac{x+y+z}{a+b+c}$",
                    "$a>0$ のとき，次の不等式が成り立つことを証明せよ：$\\sqrt{1+a} < 1+\\frac{a}{2}$",
                    "次の不等式を証明せよ：$|a|-|b| \\le |a-b|$",
                    "次の不等式を証明せよ：$|a|-|b| \\le |a+b|$",
                    "$a>0, b>0$ のとき，次の不等式が成り立つことを証明せよ：$ab+\\frac{4}{ab} \\ge 4$",
                    "$a>0, b>0$ のとき，次の不等式が成り立つことを証明せよ：$\\left(a+\\frac{4}{b}\\right)\\left(b+\\frac{9}{a}\\right) \\ge 25$",
                    "$a>0$ のとき，$\\left(a+\\frac{2}{a}\\right)\\left(a+\\frac{8}{a}\\right)$ の最小値を求めよ。",
                    "面積が一定値 $S$ である長方形のうち，周の長さが最小となるのは正方形である。このことを，長方形の隣り合う2辺の長さを $a, b$ とし，$a, b$ について相加平均と相乗平均の大小関係を用いて証明せよ。"
                ]
            },
            "第2章 複素数と方程式": {
                "1. 複素数と2次方程式": [
                    "次の式を計算せよ：$(\\sqrt{-2}+\\sqrt{5})(\\sqrt{-24}-\\sqrt{15})$",
                    "次の式を計算せよ：$(1+i)^3$",
                    "次の式を計算せよ：$i+i^2+i^3+i^4+\\frac{1}{i}$",
                    "次の式を計算せよ：$\\frac{1-i}{2-i}+\\frac{1+i}{2+i}$",
                    "次の等式を満たす実数 $x, y$ の値を求めよ：$(4-3i)x-(3-2i)y=6-5i$",
                    "次の等式を満たす実数 $x, y$ の値を求めよ：$(1+i)(x-yi)=1+3i$",
                    "次の2次方程式を解け：$x^2-\\sqrt{2}x+1=0$",
                    "次の2次方程式を解け：$4(x-1)^2+3=4(1-x)$",
                    "2次方程式 $x^2+(x-m)^2=3$ が虚数解をもつように，定数 $m$ の値の範囲を定めよ。",
                    "2次方程式 $x^2-4x-3=0$ の2つの解を $\\alpha, \\beta$ とするとき，次の式の値を求めよ：$(\\alpha+2\\beta)(\\beta+2\\alpha)$",
                    "2次方程式 $x^2-4x-3=0$ の2つの解を $\\alpha, \\beta$ とするとき，次の式の値を求めよ：$\\frac{\\beta^2}{\\alpha}+\\frac{\\alpha^2}{\\beta}$",
                    "2次方程式 $x^2-4x-3=0$ の2つの解を $\\alpha, \\beta$ とするとき，次の式の値を求めよ：$\\frac{\\beta}{\\alpha+1}+\\frac{\\alpha}{\\beta+1}$"
                ],
                "2. 高次方程式": [
                    "多項式 $P(x)=4x^3+ax+b$ が $x+1$ で割り切れ，$x-1$ で割ると余りが $6$ となるように，定数 $a, b$ の値を定めよ。",
                    "次の方程式を解け：$x^4+7x^2+12=0$",
                    "次の方程式を解け：$2x^3+3x^2-5x-6=0$",
                    "縦 $12\\,\\text{cm}$，横 $18\\,\\text{cm}$ の長方形の厚紙の四隅から，合同な正方形を切り取った残りで，ふたのない直方体の箱を作り，箱の深さは $2\\,\\text{cm}$ 以上，容積は $160\\,\\text{cm}^3$ にしたい。切り取る正方形の1辺の長さを求めよ。"
                ]
            },
            "第3章 図形と方程式": {
                "1. 点と直線": [
                    "2点 $\\text{A}(-1, 2)$, $\\text{B}(3, 8)$ から等距離にある $x$ 軸上の点 $\\text{P}$ の座標を求めよ。",
                    "2点 $\\text{A}(-3, 3)$, $\\text{B}(4, -2)$ を2つの頂点とし，点 $\\text{G}(3, 1)$ を重心とする $\\triangle\\text{ABC}$ の頂点 $\\text{C}$ の座標を求めよ。",
                    "4点 $\\text{A}(-3, 2)$, $\\text{B}(2, -2)$, $\\text{C}(4, 3)$, $\\text{D}$ を頂点とする平行四辺形 $\\text{ABCD}$ について，対角線 $\\text{AC}$ の中点 $\\text{M}$ の座標を求めよ。",
                    "4点 $\\text{A}(-3, 2)$, $\\text{B}(2, -2)$, $\\text{C}(4, 3)$, $\\text{D}$ を頂点とする平行四辺形 $\\text{ABCD}$ について，頂点 $\\text{D}$ の座標を求めよ。",
                    "2直線 $x+2y-3=0$, $4x-3y+10=0$ の交点を通り，直線 $3x-2y=0$ に平行な直線の方程式を求めよ。",
                    "2直線 $x+2y-3=0$, $4x-3y+10=0$ の交点を通り，直線 $3x-2y=0$ に垂直な直線の方程式を求めよ。",
                    "3点 $(0, 8)$, $(4, 0)$, $(t, t^2)$ が一直線上にあるとき，$t$ の値を求めよ。",
                    "2直線 $ax+by+c=0$, $a'x+b'y+c'=0$ について，2直線が平行 $\\iff ab'-ba'=0$ であることを証明せよ。",
                    "2直線 $ax+by+c=0$, $a'x+b'y+c'=0$ について，2直線が垂直 $\\iff aa'+bb'=0$ であることを証明せよ。ただし，$b \\neq 0$, $b' \\neq 0$ とする。",
                    "2直線 $ax+y=1$, $(a+1)x-2y=2$ が平行であるときの定数 $a$ の値を求めよ。",
                    "2直線 $ax+y=1$, $(a+1)x-2y=2$ が垂直であるときの定数 $a$ の値を求めよ。",
                    "3点 $\\text{A}(-2, 4)$, $\\text{B}(-3, -5)$, $\\text{C}(5, -1)$ について，直線 $\\text{BC}$ の方程式を求めよ。",
                    "3点 $\\text{A}(-2, 4)$, $\\text{B}(-3, -5)$, $\\text{C}(5, -1)$ について，線分 $\\text{BC}$ の長さを求めよ。",
                    "3点 $\\text{A}(-2, 4)$, $\\text{B}(-3, -5)$, $\\text{C}(5, -1)$ について，点 $\\text{A}$ と直線 $\\text{BC}$ の距離を求めよ。",
                    "3点 $\\text{A}(-2, 4)$, $\\text{B}(-3, -5)$, $\\text{C}(5, -1)$ について，$\\triangle\\text{ABC}$ の面積を求めよ。",
                    "4点 $\\text{A}(-3, 2)$, $\\text{B}(2, -2)$, $\\text{C}(4, 3)$, $\\text{D}$ を頂点とする平行四辺形について，頂点 $\\text{D}$ となりうる点の座標をすべて求めよ。"
                ]
            }
        },
        "数B": {
            "第1章 数列": {
                "第1節 数列とその和": {
                    "練習1〜3": [
                        "数列 ① $1, 3, 5, 7, 9, 11, 13, \\dots$、② $1, 2, 3, 4, 6, 9, 12, 18, 36$ の第3項と第5項を、それぞれいえ。",
                        "一般項が次の式で表される数列 $\\{a_n\\}$ について、初項から第5項までを求めよ。また、第7項と第10項を求めよ：(1) $a_n = -2n + 3$",
                        "一般項が次の式で表される数列 $\\{a_n\\}$ について、初項から第5項までを求めよ。また、第7項と第10項を求めよ：(2) $a_n = 2^n$",
                        "一般項が次の式で表される数列 $\\{a_n\\}$ について、初項から第5項までを求めよ。また、第7項と第10項を求めよ：(3) $a_n = (-1)^n$",
                        "次の数列の一般項を推測せよ：(1) $0, 2, 4, 6, 8, 10, \\dots$",
                        "次の数列の一般項を推測せよ：(2) $1, -\\frac{1}{3}, \\frac{1}{5}, -\\frac{1}{7}, \\frac{1}{9}, \\dots$"
                    ],
                    "等差数列": [
                        "次の数列が等差数列であるとき、その公差を求めよ。また、$\\square$ に適する数を求めよ：(1) $2, 6, 10, \\square, \\dots$",
                        "次の数列が等差数列であるとき、その公差を求めよ。また、$\\square$ に適する数を求めよ：(2) $\\square, 20, 17, \\square, \\dots$",
                        "問1の数列の一般項を求めよ。",
                        "初項10、公差 $-4$ の等差数列 $\\{a_n\\}$ の一般項を求めよ。また、その第10項を求めよ。",
                        "次の等差数列の一般項を求めよ。また、その第8項を求めよ：(1) $-3, 3, 9, 15, \\dots$",
                        "次の等差数列の一般項を求めよ。また、その第8項を求めよ：(2) $25, 18, 11, 4, \\dots$",
                        "公差が $-3$、第5項が17である等差数列 $\\{a_n\\}$ の初項と一般項を求めよ。",
                        "公差が2、第8項が4である等差数列 $\\{a_n\\}$ の初項と一般項を求めよ。",
                        "第10項が30、第20項が0である等差数列 $\\{a_n\\}$ がある。(1) 初項と公差を求めよ。また、一般項を求めよ。",
                        "第10項が30、第20項が0である等差数列 $\\{a_n\\}$ がある。(2) $-48$ は第何項か。",
                        "一般項が $a_n = 3n - 4$ で表される数列 $\\{a_n\\}$ は等差数列であることを示せ。また、初項と公差を求めよ。",
                        "数列 $3, b, 36$ が等差数列であるとき、$b$ の値を求めよ。",
                        "数列 $a, 6, 2a$ が等差数列であるとき、$a$ の値を求めよ。"
                    ],
                    "等差数列の和": [
                        "次のような等差数列の和を求めよ：(1) 初項6、末項 $-39$、項数10",
                        "次のような等差数列の和を求めよ：(2) 初項 $-10$、公差2、項数18",
                        "次の等差数列の和を求めよ：(1) $1, 4, 7, \\dots, 100$",
                        "次の等差数列の和を求めよ：(2) $120, 113, \\dots, -83$",
                        "正の偶数の数列 $2, 4, 6, \\dots, 2n$ の和を求めよ。",
                        "1から100までの自然数のうち、3の倍数の和を求めよ。",
                        "1から100までの自然数のうち、3で割り切れない数の和を求めよ。",
                        "10から100までの自然数のうち、4で割って3余る数の和を求めよ。",
                        "10から100までの自然数のうち、4の倍数の和を求めよ。",
                        "10から100までの自然数のうち、4で割り切れない数の和を求めよ。",
                        "初項が $-79$、公差が2である等差数列 $\\{a_n\\}$ において、初項から第何項までの和が最小となるか。また、その和を求めよ。"
                    ],
                    "等比数列": [
                        "次の数列が等比数列であるとき、$\\square$ に適する数を求めよ：(1) $-4, 8, \\square, \\dots$",
                        "次の数列が等比数列であるとき、$\\square$ に適する数を求めよ：(2) $\\square, \\frac{1}{9}, -\\frac{1}{27}, \\dots$",
                        "問6の数列の一般項を求めよ。",
                        "次の等比数列の一般項を求めよ。また、第7項を求めよ：(1) $5, 10, 20, 40, \\dots$",
                        "次の等比数列の一般項を求めよ。また、第7項を求めよ：(2) $-2, 2, -2, 2, \\dots$",
                        "次の等比数列の一般項を求めよ。また、第7項を求めよ：(3) $1, -3, 9, -27, \\dots$",
                        "次の等比数列の一般項を求めよ。また、第7項を求めよ：(4) $9, 6, 4, \\frac{8}{3}, \\dots$",
                        "第3項が6、第7項が486である等比数列 $\\{a_n\\}$ の初項と公比を求めよ。また、一般項を求めよ。ただし、公比は実数とする。",
                        "$a, b, c$ が0でないとき、数列 $a, b, c$ が等比数列 $\\iff b^2 = ac$ であることを示せ。",
                        "数列 $\\frac{1}{2}, b, 8$ が等比数列であるとき、$b$ の値を求めよ。"
                    ],
                    "等比数列の和": [
                        "次のような等比数列の和を求めよ：(1) 初項1、公比3、項数5",
                        "次のような等比数列の和を求めよ：(2) 初項3、公比 $-2$、項数7",
                        "次の等比数列の初項から第 $n$ 項までの和を求めよ：(1) $1, 2, 4, 8, \\dots$",
                        "次の等比数列の初項から第 $n$ 項までの和を求めよ：(2) $9, 0.9, 0.09, 0.009, \\dots$",
                        "第3項が4、初項から第3項までの和が7である等比数列の、初項 $a$ と公比 $r$ を求めよ。"
                    ],
                    "シグマ記号と和の計算": [
                        "恒等式 $(k+1)^4 - k^4 = 4k^3 + 6k^2 + 4k + 1$ を利用して、$1^3 + 2^3 + 3^3 + \\dots + n^3 = \\left\\{ \\frac{1}{2}n(n+1) \\right\\}^2$ を証明せよ。",
                        "次の和を求めよ：(1) $1^2 + 2^2 + 3^2 + \\dots + 20^2$",
                        "次の和を求めよ：(2) $1^3 + 2^3 + 3^3 + \\dots + 7^3$",
                        "次の数列の和を、$\\sum$ を用いないで、各項を書き並べて表せ：(1) $\\sum_{k=1}^n (5k-1)$",
                        "次の数列の和を、$\\sum$ を用いないで、各項を書き並べて表せ：(2) $\\sum_{k=1}^n 2^{k+1}$",
                        "次の数列の和を、$\\sum$ を用いないで、各項を書き並べて表せ：(3) $\\sum_{k=3}^{15} (2k+1)^2$",
                        "等式 $\\sum_{k=1}^{10} (2k+1) = \\sum_{i=2}^{11} (2i-1)$ が成り立つことを確かめよ。",
                        "次の和を求めよ：(1) $\\sum_{k=1}^n 5^{k-1}$",
                        "次の和を求めよ：(2) $\\sum_{k=1}^{n-1} 3^k$",
                        "次の和を求めよ：(1) $\\sum_{k=1}^{15} 2$",
                        "次の和を求めよ：(2) $\\sum_{k=1}^{10} k$",
                        "次の和を求めよ：(3) $\\sum_{k=1}^8 k^2$",
                        "次の和を求めよ：(4) $\\sum_{k=1}^6 k^3$",
                        "次の和を求めよ：(1) $\\sum_{k=1}^n (4k+3)$",
                        "次の和を求めよ：(2) $\\sum_{k=1}^n (3k^2 - 7k + 4)$",
                        "次の和を求めよ：(3) $\\sum_{k=1}^n k(k+2)$",
                        "次の和を求めよ：(4) $\\sum_{k=1}^{n-1} 5k$",
                        "次の和を求めよ：$1 \\cdot 2 \\cdot 3 + 2 \\cdot 3 \\cdot 4 + 3 \\cdot 4 \\cdot 5 + \\dots + n(n+1)(n+2)$",
                        "次の数列の第 $k$ 項を求めよ。また、初項から第 $n$ 項までの和を求めよ：$1^2,\\quad 1^2 + 2^2,\\quad 1^2 + 2^2 + 3^2,\\quad \\dots,\\quad 1^2 + 2^2 + 3^2 + \\dots + n^2,\\quad \\dots$"
                    ],
                    "階差数列とその他の和": [
                        "次の数列の階差数列は、どのような数列か：(1) 等差数列 $1, 5, 9, 13, 17, 21, \\dots$",
                        "次の数列の階差数列は、どのような数列か：(2) 等比数列 $1, 3, 9, 27, 81, 243, \\dots$",
                        "次の数列の一般項を求めよ：(1) $2, 7, 14, 23, 34, 47, \\dots$",
                        "次の数列の一般項を求めよ：(2) $1, 4, 13, 40, 121, 364, \\dots$",
                        "初項から第 $n$ 項までの和 $S_n$ が次の式で表される数列 $\\{a_n\\}$ の一般項を求めよ：(1) $S_n = 3n^2 - 2n$",
                        "初項から第 $n$ 項までの和 $S_n$ が次の式で表される数列 $\\{a_n\\}$ の一般項を求めよ：(2) $S_n = 3^n - 1$",
                        "恒等式 $\\frac{1}{(2k-1)(2k+1)} = \\frac{1}{2} \\left( \\frac{1}{2k-1} - \\frac{1}{2k+1} \\right)$ を証明せよ。",
                        "次の和 $S$ を求めよ：$S = \\frac{1}{1\\cdot 3} + \\frac{1}{3\\cdot 5} + \\frac{1}{5\\cdot 7} + \\dots + \\frac{1}{(2n-1)(2n+1)}$",
                        "恒等式 $\\frac{1}{\\sqrt{k}+\\sqrt{k+1}} = \\sqrt{k+1} - \\sqrt{k}$ を証明せよ。",
                        "次の和 $S$ を求めよ：$S = \\frac{1}{\\sqrt{1}+\\sqrt{2}} + \\frac{1}{\\sqrt{2}+\\sqrt{3}} + \\frac{1}{\\sqrt{3}+\\sqrt{4}} + \\dots + \\frac{1}{\\sqrt{n}+\\sqrt{n+1}}$",
                        "次の和 $S$ を求めよ：$S = 1\\cdot 1 + 3\\cdot 3 + 5\\cdot 3^2 + \\dots + (2n-1)\\cdot 3^{n-1}$",
                        "自然数 $r=1$ のとき，$S = 1 + 2r + 3r^2 + \\dots + nr^{n-1}$ を求めよ。",
                        "自然数 $r\\neq 1$ のとき，$S = 1 + 2r + 3r^2 + \\dots + nr^{n-1}$ を求めよ。",
                        "自然数の列を、次のように群に分ける。第 $n$ 群の最初の自然数を求めよ：$1 \\mid 2, 3, 4 \\mid 5, 6, 7, 8, 9 \\mid 10, \\dots$",
                        "自然数の列を群に分けるとき、第10群にあるすべての自然数の和を求めよ。"
                    ],
                    "第1節 問題": [
                        "第3項が17, 初項から第6項までの和が120である等差数列 $\\{a_n\\}$ の一般項を求めよ。また、$100 < a_n < 200$ を満たす項の和を求めよ。",
                        "公比が正の数である等比数列 $\\{a_n\\}$ について $a_1 + a_2 = 3$, $a_3 + a_4 = 12$ であるという。この数列の第7項を求めよ。",
                        "項数 $n$ の数列 $1\\cdot n,\\; 2\\cdot (n-1),\\; 3\\cdot (n-2),\\; \\dots,\\; n\\cdot 1$ について、(1) 第 $k$ 項を $k$ の式で表せ。",
                        "項数 $n$ の数列 $1\\cdot n,\\; 2\\cdot (n-1),\\; 3\\cdot (n-2),\\; \\dots,\\; n\\cdot 1$ について、(2) この数列の和を求めよ。",
                        "$a_1 = 2, a_2 = 5, a_3 = 11$ を満たす数列 $\\{a_n\\}$ について、(1) 階差数列が等差数列であるときの一般項を求めよ。",
                        "$a_1 = 2, a_2 = 5, a_3 = 11$ を満たす数列 $\\{a_n\\}$ について、(2) 階差数列が等比数列であるときの一般項を求めよ。",
                        "初項から第 $n$ 項までの和 $S_n = n\\cdot 2^n$ で表される数列 $\\{a_n\\}$ の一般項を求めよ。",
                        "初項から第 $n$ 項までの和 $S_n = \\frac{1}{3}n(n+1)(n+2)$ で表される数列 $\\{a_n\\}$ の一般項を求めよ。",
                        "初項から第 $n$ 項までの和 $S_n = n^3 + 2n + 6$ で表される数列 $\\{a_n\\}$ の一般項を求めよ。",
                        "次の和 $S$ を求めよ：$S = \\frac{1}{\\sqrt{1}+\\sqrt{3}} + \\frac{1}{\\sqrt{3}+\\sqrt{5}} + \\frac{1}{\\sqrt{5}+\\sqrt{7}} + \\dots + \\frac{1}{\\sqrt{2n-1}+\\sqrt{2n+1}}$",
                        "等差数列をなす3つの数があって、その和は18, 積は162である。この3つの数を求めよ。",
                        "自然数 $n$ が $n$ 個ずつ続く数列 $1,\\; 2, 2,\\; 3, 3, 3,\\; \\dots$ について、(1) 自然数 $n$ が初めて現れるのは第何項か。",
                        "自然数 $n$ が $n$ 個ずつ続く数列について、(2) 第100項を求めよ。"
                    ]
                },
                "第2節 数学的帰納法": {
                    "漸化式": [
                        "次の条件によって定められる数列 $\\{a_n\\}$ の第5項を求めよ：(1) $a_1 = 2, \\quad a_{n+1} = 3a_n + 4$",
                        "次の条件によって定められる数列 $\\{a_n\\}$ の第5項を求めよ：(2) $a_1 = 1, \\quad a_{n+1} = 2a_n + n$",
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：(1) $a_1 = 2, \\quad a_{n+1} = a_n + 3$",
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：(2) $a_1 = 1, \\quad a_{n+1} = -2a_n$",
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：(1) $a_1 = 3, \\quad a_{n+1} = a_n - 5$",
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：(2) $a_1 = -2, \\quad a_{n+1} = 3a_n$",
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：(1) $a_1 = 2, \\quad a_{n+1} = a_n + 3^n$",
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：(2) $a_1 = 2, \\quad a_{n+1} = a_n + n^2 + n$",
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：(1) $a_1 = 1, \\quad a_{n+1} = 2a_n + 3$",
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：(2) $a_1 = 0, \\quad a_{n+1} = 1 - \\frac{1}{2}a_n$",
                        "平面上に $n$ 本の直線があって、どの2本も平行でなく、どの3本も1点で交わらないとき、交点はいくつできるか。",
                        "1個のさいころを $n$ 回投げるとき、1の目が偶数回出る確率を $p_n$ とする。$p_1$ を求めよ。また、$p_n$ を $n$ の式で表せ。",
                        "$\\triangle \\mathrm{ABC}$ の頂点を移動する点 $\\mathrm{P}$ がある。$n$ 秒後に頂点 $\\mathrm{B}$ にいる確率を $p_n$ とする。$p_n$ を $n$ の式で表せ。"
                    ],
                    "発展・応用漸化式": [
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：(1) $a_1 = 1, \\quad a_2 = 4, \\quad a_{n+2} + a_{n+1} - 6a_n = 0$",
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：(2) $a_1 = 0, \\quad a_2 = 1, \\quad a_{n+2} = 8a_{n+1} - 7a_n$",
                        "$a_1 = 0, a_2 = 2, a_{n+2} - 4a_{n+1} + 4a_n = 0$ について、(1) $a_{n+1} - 2a_n = 2^n$ であることを示せ。",
                        "$a_1 = 0, a_2 = 2, a_{n+2} - 4a_{n+1} + 4a_n = 0$ について、(2) $\\frac{a_n}{2^n} = b_n$ とおいて数列 $\\{b_n\\}$ の一般項を求めよ。",
                        "$a_1 = 0, a_2 = 2, a_{n+2} - 4a_{n+1} + 4a_n = 0$ について、(3) 数列 $\\{a_n\\}$ の一般項を求めよ。",
                        "$a_1 = 0, b_1 = 1, a_{n+1} = a_n + 3b_n, b_{n+1} = a_n - b_n$ について、(1) 数列 $\\{a_n + b_n\\}, \\{a_n - 3b_n\\}$ の一般項を求めよ。",
                        "$a_1 = 0, b_1 = 1, a_{n+1} = a_n + 3b_n, b_{n+1} = a_n - b_n$ について、(2) 数列 $\\{a_n\\}, \\{b_n\\}$ の一般項を求めよ。"
                    ],
                    "数学的帰納法": [
                        "数学的帰納法によって次の等式を証明せよ：(1) $1 + 2 + 2^2 + \\dots + 2^{n-1} = 2^n - 1$",
                        "数学的帰納法によって次の等式を証明せよ：(2) $1^2 + 2^2 + 3^2 + \\dots + n^2 = \\frac{1}{6}n(n+1)(2n+1)$",
                        "$5^n - 1$ は4の倍数であることを数学的帰納法によって証明せよ。",
                        "$a > 0$ で、$n$ は自然数のとき不等式 $(1+a)^n \\ge 1 + na$ を数学的帰納法によって証明せよ。",
                        "$n$ は2以上の自然数のとき不等式 $3^n > 4n$ を数学的帰納法によって証明せよ。",
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：$a_1 = 2, \\quad a_{n+1} = 2 - \\frac{1}{a_n}$",
                        "$n$ は自然数のとき $4n^3 - n$ は3の倍数であることを数学的帰納法によって証明せよ。",
                        "$n$ は整数のとき $4n^3 - n$ は3の倍数であることを証明せよ。",
                        "$5^n - 1 = (4+1)^n - 1$ と変形して $5^n - 1$ が4の倍数であることを二項定理を利用して証明せよ。"
                    ],
                    "第2節 問題": [
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：(1) $a_1 = 4, \\quad a_{n+1} = a_n - 3$",
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：(2) $a_1 = 1, \\quad a_{n+1} = 1 - a_n$",
                        "次の条件によって定められる数列 $\\{a_n\\}$ の一般項を求めよ：(3) $a_1 = 1, \\quad 2a_{n+1} - a_n + 2 = 0$",
                        "$a_1 = \\frac{1}{3}, \\frac{1}{a_{n+1}} - \\frac{1}{a_n} = 2n + 3$ について、(1) $\\frac{1}{a_n} = b_n$ とおいて数列 $\\{b_n\\}$ の一般項を求めよ。",
                        "$a_1 = \\frac{1}{3}, \\frac{1}{a_{n+1}} - \\frac{1}{a_n} = 2n + 3$ について、(2) 数列 $\\{a_n\\}$ の一般項を求めよ。",
                        "$n$ は4以上の自然数。数学的帰納法によって不等式 $2^n > n^2 - n + 2$ を証明せよ。",
                        "$a_1 = 1, a_{n+1} = \\frac{4}{4 - a_n}$ について、(1) $a_2, a_3, a_4, a_5$ を求めよ。",
                        "$a_1 = 1, a_{n+1} = \\frac{4}{4 - a_n}$ について、(2) 一般項 $a_n$ を推測して数学的帰納法で証明せよ。",
                        "24時間に1回服用する薬。服用直後の有効成分100mg増加、24時間ごとに20%になる。$n$ 回目に服用した直後の有効成分量を $a_n$ mgとするとき、(1) $a_{n+1}$ を $a_n$ の式で表せ。",
                        "薬の有効成分量について、(2) $a_n$ を $n$ の式で表せ。"
                    ],
                    "第1章 演習問題": [
                        "和 $S = 3\\cdot 2 + 5\\cdot 2^2 + 7\\cdot 2^3 + \\dots + (2n+1)\\cdot 2^n$ を求めよ。",
                        "$a_1 = 1, a_{n+1} = \\frac{a_n}{a_n + 3}$ について、(1) $\\frac{1}{a_n} = b_n$ とおいて数列 $\\{b_n\\}$ の一般項を求めよ。",
                        "$a_1 = 1, a_{n+1} = \\frac{a_n}{a_n + 3}$ について、(2) 数列 $\\{a_n\\}$ の一般項を求めよ。",
                        "$a_1 = 2, a_{n+1} = 2a_n - n + 1$ について、(1) $a_{n+1} - a_n = b_n$ とおいて数列 $\\{b_n\\}$ の一般項を求めよ。",
                        "$a_1 = 2, a_{n+1} = 2a_n - n + 1$ について、(2) 数列 $\\{a_n\\}$ の一般項を求めよ。",
                        "数列の初項から第 $n$ 項までの和 $S_n = 3n - 2a_n$ について、(1) $a_{n+1}$ を $a_n$ の式で表せ。",
                        "初項から第 $n$ 項までの和 $S_n = 3n - 2a_n$ について、(2) 数列 $\\{a_n\\}$ の一般項を求めよ。",
                        "$a_1 = 1, n a_{n+1} - 2(n+1) a_n = n(n+1)$ について、(1) $\\frac{a_n}{n} = b_n$ とおいて数列 $\\{b_n\\}$ の一般項を求めよ。",
                        "$a_1 = 1, n a_{n+1} - 2(n+1) a_n = n(n+1)$ について、(2) 数列 $\\{a_n\\}$ の一般項を求めよ。",
                        "数列の各項が1より小さい正の数のとき，$n \\ge 2$ で $(1-a_1)(1-a_2)\\cdots(1-a_n) > 1 - (a_1 + a_2 + \\dots + a_n)$ が成り立つことを証明せよ。"
                    ]
                }
            },
            "第2章 統計的な推測": {
                "第1節 確率分布": [
                    "100円硬貨と10円硬貨を1枚ずつ投げるとき、表の出た硬貨の金額の和を $X$ 円とする。確率変数 $X$ の確率分布を求めよ。",
                    "1から5までの数字が1つずつ記入された5枚のカードがある。1枚抜き出し、その数字を $X$ とする。期待値を求めよ。",
                    "白玉7個と黒玉3個から、もとに戻さずに2回続けて取り出すとき、白玉の出る回数を $X$ とする。期待値を求めよ。",
                    "赤玉3個と白玉2個から同時に3個取り出すときの赤玉の個数を $X$ とする。分散と標準偏差を求めよ。",
                    "練習4の確率変数 $X$ の分散と標準偏差を、公式 $V(X) = E(X^2) - \\{E(X)\\}^2$ を用いて求めよ。",
                    "1個のさいころを投げたときの目 $X$ について，$Y = X + 1$ の期待値、分散、標準偏差を求めよ。",
                    "1個のさいころを投げたときの目 $X$ について，$Y = -2X$ の期待値、分散、標準偏差を求めよ。",
                    "1個のさいころを投げたときの目 $X$ について，$Y = 3X - 2$ の期待値、分散、標準偏差を求めよ。",
                    "1から3までの番号のついた3枚の札から、Aが1枚、残る札からBが1枚引くとき、札の番号 $X, Y$ の同時分布を求めよ。",
                    "1〜10の袋Aと1〜20の袋Bから1枚ずつ引くとき、番号の和 $X+Y$ の期待値を求めよ。",
                    "1個のさいころを2回投げる目 $X, Y$ について、確率変数 $4X-2Y$ の期待値を求めよ。",
                    "確率変数 $X+2Y$ の期待値を求めよ。",
                    "3個のさいころの目 $X, Y, Z$ の和 $X+Y+Z$ の期待値を求めよ。",
                    "10円、50円、100円硬貨を同時に投げるとき、金額の和の期待値を求めよ。",
                    "100円2枚、10円2枚を同時に投げ、100円の表の出る枚数 $X$、10円の表の出る枚数 $Y$ について $P(X=a, Y=b) = P(X=a)P(Y=b)$ が成り立つことを確かめよ。",
                    "大小2個のさいころの目 $X, Y$ が独立であることを確かめよ。",
                    "大小2個のさいころの目について、大きい方が1である事象 $A$、小さい方が2である事象 $B$、和が6である事象 $C$ について $B$ と $C$ は独立か従属か。",
                    "2つの確率変数 $X, Y$ が独立でそれぞれの確率分布が与えられているとき、積 $XY$ の期待値を求めよ。",
                    "3個のさいころの目 $X, Y, Z$ の積 $XYZ$ の期待値を求めよ。",
                    "確率変数 $X$ の期待値-3、分散5、確率変数 $Y$ の期待値2、分散4が独立のとき,$X+Y$ の期待値、分散、標準偏差を求めよ。",
                    "練習15の確率変数 $X, Y$ について、$2X-Y$ の分散、標準偏差を求めよ。",
                    "3個のさいころの目 $X, Y, Z$ の和 $X+Y+Z$ の分散を求めよ。",
                    "二項分布 $B(12, 1/4)$ の平均、分散、標準偏差を求めよ。",
                    "二項分布 $B(9, 1/2)$ の平均、分散、標準偏差を求めよ。",
                    "二項分布 $B(8, 2/3)$ の平均、分散、標準偏差を求めよ。",
                    "1枚の硬貨を10回投げて表が出る回数 $X$ の二項分布の形を定式化し、期待値と標準偏差を求めよ。",
                    "不良率3%の製品の山から50個取り出したときの不良品数 $X$ の期待値と標準偏差を求めよ。",
                    "確率密度関数 $f(x) = 0.2 \\ (0 \\le x \\le 5)$ のとき $P(0 \\le X \\le 1)$ および $P(1 \\le X \\le 3)$ を求めよ。",
                    "確率密度関数 $f(x) = \\frac{x}{2} \\ (0 \\le x \\le 2)$ のとき $P(0 \\le X \\le 1)$ および $P(1 \\le X \\le 2)$ を求めよ。",
                    "確率密度関数 $f(x) = 2x \\ (0 \\le x \\le 1)$ の期待値、分散、標準偏差を求めよ。",
                    "練習20(1), (2)の期待値、分散、標準偏差を求めよ。",
                    "標準正規分布 $N(0, 1)$ に従うとき $P(Z \\le 1)$, $P(Z \\ge 0.5)$, $P(-2 \\le Z \\le -1)$, $P(|Z| \\le 1)$, $P(|Z| \\le 2)$, $P(|Z| \\le 3)$ を求めよ。",
                    "正規分布 $N(2, 5^2)$ に従うとき $P(-8 \\le X \\le 12)$, $P(X \\le 4)$, $P(0 \\le X \\le 5)$ を求めよ。",
                    "高校2年生男子の身長が平均170.6cm、標準偏差5cmの正規分布に従うとき、(1) $P(Z \\ge u) = 0.2$ となる $u$ を求めよ。",
                    "高校2年生男子の身長について、(2) 身長の高い方から20%の中に入るのは何cm以上か。",
                    "高校2年生女子の身長が平均157.8cm、標準偏差5.4cmのとき、(1) 165cm以上は約何%か。",
                    "高校2年生女子の身長について、(2) 154cm以上160cm以下は約何%か。",
                    "高校2年生女子の身長について、(3) 低い方から4%は何cm以下か。",
                    "1枚の硬貨を400回投げるとき、表の出る回数が180以上200以下である確率を求めよ。"
                ],
                "第1節 問題": [
                    "さいころを2回投げて、出る目の差の絶対値を $X$ とする。期待値と分散を求めよ。",
                    "袋A(黒2,白3)、袋B(黒4,白1)から2個ずつ取り出す。黒玉の個数を $X, Y$ とするとき $X+Y$ の期待値と分散を求めよ。",
                    "$X$ が $B(100, 1/5)$ に従うとき、(1) $Y = 3X - 2$ の期待値と分散を求めよ。",
                    "$X$ が $B(100, 1/5)$ に従うとき、(2) $Y = -X$ の期待値と分散を求めよ。",
                    "$X$ が $B(100, 1/5)$ に従うとき、(3) $Y = \\frac{X - 20}{4}$ の期待値と分散を求めよ。",
                    "確率変数 $X$ の確率密度関数 $f(x) = ax \\ (0 \\le x \\le 1)$, $a(2-x) \\ (1 \\le x \\le 2)$ について、(1) 定数 $a$ を求めグラフをかけ。",
                    "確率密度関数について、(2) $P(0.5 \\le X \\le 1.5)$ を求めよ。",
                    "正規分布 $N(50, 10^2)$ に従うとき、(1) $P(X \\le 70)$ を求めよ。",
                    "正規分布 $N(50, 10^2)$ に従うとき、(2) $P(55 \\le X \\le 65)$ を求めよ。",
                    "平均64点、標準偏差14点のとき、(1) 36点以上92点以下が400人いた場合の総数を求めよ。",
                    "平均64点、標準偏差14点のとき、(2) 合格点を50点とすると何人合格するか。"
                ],
                "第2節 統計的な推測": [
                    "1〜4のカード4枚から大きさ2の無作為標本を抽出する $X_1, X_2$ の同時分布：(1) 復元抽出",
                    "1〜4のカード4枚から大きさ2の無作為標本を抽出する $X_1, X_2$ の同時分布：(2) 非復元抽出",
                    "10枚のカードの母集団分布、母平均、母標準偏差を求めよ。",
                    "標本平均 $\\bar{X}$ の確率分布を復元抽出・非復元抽出について求めよ。",
                    "体重の平均64.1kg、標準偏差10.5kg。100人無作為抽出のときの平均 $\\bar{X}$ の期待値と標準偏差を求めよ。",
                    "血液型が10人に1人のAB型。$n$ 人無作為抽出の標本平均の期待値と標準偏差を求めよ。",
                    "母平均50、母標準偏差10の母集団から大きさ100を抽出するとき、標本平均が52より大きい確率を求めよ。",
                    "硬貨 $n$ 回の相対度数 $R$ について、$n=100$ のとき $P(|R - 0.5| \\le 0.05)$ を求めよ。",
                    "$n=400, 900$ の場合の $P(|R - 0.5| \\le 0.05)$ を求めよ。",
                    "母平均 $m$ に対する信頼度95%の信頼区間を求めよ。",
                    "塩の袋100個の平均502g、母標準偏差10gとして、信頼度95%で平均を推定せよ。",
                    "製品400個の平均12.4cm、母標準偏差0.8cmとして、信頼度95%で平均を推定せよ。",
                    "清涼飲料水100本の平均12.5mg、標準偏差1.2mgとして、信頼度95%で平均を推定せよ。",
                    "高校1年生400人中むし歯228人。保有率 $p$ を信頼度95%で推定せよ。",
                    "さいころ600回で1の目が120回。1の目の出る確率が $1/6$ でないと判断してよいか有意水準5%で検定せよ。",
                    "品種改良した種子400個中328個発芽。従来75%。発芽率が上がったと判断してよいか有意水準1%で検定せよ。",
                    "缶詰100個の平均198g、標準偏差5g。表示200gは表示通りでないと判断してよいか有意水準5%で検定せよ。"
                ],
                "第2節 問題": [
                    "1〜5の数字の玉がその数字と同じ個数ある母集団の分布と母平均・母標準偏差を求めよ。",
                    "5人の生徒の100m走の記録について、(1) 母平均と母標準偏差を求めよ。",
                    "5人の生徒の記録について、(2) 非復元抽出による大きさ2の標本平均 $\\bar{X}$ の確率分布を求めよ。",
                    "5人の生徒の記録について、(3) $\\bar{X}$ の期待値と標準偏差を求めよ。",
                    "照明器具100個の平均1500時間、標準偏差120時間のとき、信頼度95%で平均有効時間を推定せよ。",
                    "プロ野球A, Bの対戦成績Aの18勝10敗。力に差があると判断してよいか有意水準5%で検定せよ。",
                    "A社製品の新製法で1000個中78個不良品。不良率は従来10%より下がったか有意水準5%で検定せよ。"
                ],
                "第2章 演習問題": [
                    "さいころ2回の目の和 $X$ の期待値と分散を求めよ。",
                    "10円硬貨2枚と100円硬貨1枚の金額の和の期待値と標準偏差を求めよ。",
                    "白2黒3の袋から玉を取り出し戻す操作5回。白玉の出る回数の期待値と標準偏差を求めよ。",
                    "母集団の変量 $X$ から復元抽出した大きさ4の標本平均 $\\bar{X}$ の期待値と標準偏差を求めよ。",
                    "製品400個中16個不良品。不良率を信頼度95%で推定せよ。",
                    "紙パック飲料100本の平均198.5mL、標準偏差5mL。平均内容は表示200mL通りでないか有意水準5%で検定せよ。",
                    "さいころ1回の最大値 $X$ について、(1) 確率分布を求めよ。",
                    "さいころ1回の最大値 $X$ について、(2) 期待値と標準偏差を求めよ。",
                    "受験者1000名、平均260点、標準偏差50点、合格者200名。正規分布とみなすとき合格最低点は何点か。",
                    "さいころ $n$ 回の1の目について $P(|X/n - 1/6| \\le 0.01) \\ge 0.95$ となる $n$ を求めよ。",
                    "賛成率約60%を信頼区間幅0.04以下、信頼度95%で推定するのに必要な人数を求めよ。",
                    "生徒100人中A支持60人、B支持40人。全生徒1000人として、(1) Aの得票数を信頼度95%で推定せよ。",
                    "生徒の選挙調査について、(2) Aの支持率が高いと判断してよいか有意水準5%で検定せよ。"
                ]
            },
            "第3章 数学と社会生活": {
                "第1節 数学を活用した問題解決": [
                    "富士山頂の標高3776m、地球半径6370km、見下ろす場所の標高0mのとき山頂を結ぶ線分の長さの最大値を求めよ。",
                    "富士山頂を見ることができる場所 P の標高 $h$ mのときの距離の最大値を求めよ。また色川富士見峠(900m)からの距離を計算せよ。",
                    "新雑誌1冊の価格 $x$ 円、販売冊数 $y$ 冊のときの利益を求めよ（製造費200円）。",
                    "価格 $x$ のときの販売予想冊数 $y$ の関係を表にまとめる。",
                    "価格を100円上げると販売冊数が減少する仮定で利益が最大となる価格を定める。",
                    "LED、蛍光灯、白熱電球の100日使用の費用を計算し最も経済的な電球を答える。",
                    "使用時間 $x$ と費用 $y$ の関係を各電球でグラフにする。",
                    "使用時間に応じた最適な電球の選び方を考察する。",
                    "シェアサイクルA, B間の自転車移動モデルの漸化式を作成する。",
                    "日数が経過したときの $a_n, b_n$ の極限的挙動を考察する。",
                    "合計100台の自転車を運用する場合の各ポートの配置台数を求める。",
                    "返却割合が変動する場合の最大収容台数を求める。"
                ],
                "第2節 社会の中にある数学": [
                    "都市の4つの選挙区に対して議席数10を最大剰余方式で割り振る。",
                    "議席総数を11に変更した場合の割り振りを行う。"
                ]
            }
        },
        "数Ⅲ": {
            "第1章 関数": {
                "第1節 分数関数・無理関数・逆関数と合成関数": [
                    "次の関数のグラフをかけ：$y = \\frac{1}{x}$",
                    "次の関数のグラフをかけ：$y = \\frac{2}{x}$",
                    "次の関数のグラフをかけ：$y = -\\frac{3}{x}$",
                    "次の関数のグラフをかけ：$y = \\frac{1}{2x}$",
                    "次の関数のグラフをかけ。また、その定義域と値域を求めよ：$y = -\\frac{2}{x} - 1$",
                    "次の関数のグラフをかけ。また、その定義域と値域を求めよ：$y = \\frac{3}{x+2}$",
                    "次の関数のグラフをかけ。また、その定義域と値域を求めよ：$y = -\\frac{1}{x-1} + 2$",
                    "関数 $y = \\frac{3x-7}{x-2}$ のグラフをかけ。また、その定義域と値域を求めよ。",
                    "次の関数のグラフをかけ。また、その定義域と値域を求めよ：$y = \\frac{2x+7}{x+3}$",
                    "次の関数のグラフをかけ。また、その定義域と値域を求めよ：$y = \\frac{1-2x}{x-1}$",
                    "次の関数のグラフをかけ。また、その定義域と値域を求めよ：$y = \\frac{4x+3}{2x-1}$",
                    "次の2つの関数のグラフの共地点の座標を求めよ：$y = \\frac{2x}{x-1}, \\quad y = 2x$",
                    "次の2つの関数のグラフの共地点の座標を求めよ：$y = \\frac{4x+1}{2x+3}, \\quad y = 2x-1$",
                    "関数のグラフを利用して、不等式 $\\frac{2}{x-1} > x$ を解け。",
                    "次の方程式、不等式を解け：$\\frac{3x}{x+2} = -x+2$",
                    "次の方程式、不等式を解け：$\\frac{3x}{x+2} < -x+2$",
                    "関数 $y = -\\sqrt{x}$ のグラフと関数 $y = \\sqrt{x}$ のグラフの位置関係をいえ。",
                    "次の関数のグラフをかけ。また、そのグラフと関数 $y = \\sqrt{x}$ のグラフの位置関係をいえ：$y = \\sqrt{-x}$",
                    "次の関数のグラフをかけ。また、そのグラフと関数 $y = \\sqrt{x}$ のグラフの位置関係をいえ：$y = -\\sqrt{-x}$",
                    "次の関数のグラフをかけ。また、その定義域と値域を求めよ：$y = \\sqrt{2x}$",
                    "次の関数のグラフをかけ。また、その定義域と値域を求めよ：$y = -\\sqrt{2x}$",
                    "次の関数のグラフをかけ。また、その定義域と値域を求めよ：$y = -\\sqrt{-2x}$",
                    "次の関数のグラフをかけ。また、その定義域と値域を求めよ：$y = \\sqrt{2x+4}$",
                    "次の関数のグラフをかけ。また、その定義域と値域を求めよ：$y = \\sqrt{-1-x}$",
                    "関数 $y = \\sqrt{x+2} \\quad (-1 \\le x \\le 3)$ の値域を求めよ。",
                    "関数 $y = \\sqrt{6-3x} \\quad (-1 \\le x < 1)$ の値域を求めよ。",
                    "次の2つの関数のグラフの共地点の座標を求めよ：$y = \\sqrt{2x+3}, \\quad y = x$",
                    "次の2つの関数のグラフの共地点の座標を求めよ：$y = \\sqrt{2x-1}, \\quad y = x + \\frac{1}{2}$",
                    "次の方程式、不等式を解け：$\\sqrt{x+1} = -x+1$",
                    "次の方程式、不等式を解け：$\\sqrt{x+1} < -x+1$",
                    "次の関数の逆関数を求めよ：$y = \\frac{1}{2}x - 2$",
                    "次の関数の逆関数を求めよ：$y = -3x + 1$",
                    "次の関数の逆関数を求めよ：$y = -3x + 4 \\quad (-1 \\le x \\le 2)$",
                    "次の関数の逆関数を求めよ：$y = x^2 \\quad (x \\le 0)$",
                    "次の関数の逆関数を求めよ：$y = x^2 - 2 \\quad (x \\ge 0)$",
                    "次の関数の逆関数を求めよ：$y = \\frac{2x+1}{x+1}$",
                    "次の関数の逆関数を求めよ：$y = \\frac{-x+4}{x-3}$",
                    "1次関数 $f(x) = ax + b$ について、$f(3) = 5, f^{-1}(3) = 2$ であるとき、定数 $a, b$ の値を求めよ。",
                    "次の関数の逆関数を求めよ。また、そのグラフをかけ：$y = \\sqrt{-x}$",
                    "次の関数の逆関数を求めよ。また、そのグラフをかけ：$y = x^2 \\quad (2 \\le x \\le 4)$",
                    "次の関数の逆関数を求めよ。また、そのグラフをかけ：$y = \\left(\\frac{1}{2}\\right)^x$",
                    "次の関数の逆関数を求めよ。また、そのグラフをかけ：$y = \\log_3 x$",
                    "$f(x) = x+1, g(x) = |x|+1, h(x) = \\log_2 x$ のとき、合成関数 $(g \\circ f)(x)$ を求めよ。",
                    "$f(x) = x+1, g(x) = |x|+1, h(x) = \\log_2 x$ のとき、合成関数 $(f \\circ g)(x)$ を求めよ。",
                    "$f(x) = x+1, g(x) = |x|+1, h(x) = \\log_2 x$ のとき、合成関数 $(h \\circ g)(x)$ を求めよ。"
                ],
                "第1章 問題": [
                    "$-2 < x \\le 0$ において、次の関数のグラフをかき、その値域を求めよ：$y = -\\frac{2x+3}{x+3}$",
                    "$-2 < x \\le 0$ において、次の関数のグラフをかき、その値域を求めよ：$y = \\frac{3x+2}{x+2}$",
                    "次の方程式、不等式を解け：$\\frac{3x-6}{x-1} = -x+6$",
                    "次の方程式、不等式を解け：$\\frac{3x-6}{x-1} \\ge -x+6$",
                    "次の方程式、不等式を解け：$\\frac{-x}{x+2} \\le -x+1$",
                    "次の方程式、不等式を解け：$\\frac{x-3}{x-2} > x+1$",
                    "次の関数のグラフをかき、その値域を求めよ：$y = -\\sqrt{x+1} \\quad (-1 \\le x < 2)$",
                    "次の関数のグラフをかき、その値域を求めよ：$y = -2\\sqrt{3-x} \\quad (-2 \\le x \\le 2)$",
                    "次の方程式、不等式を解け：$\\sqrt{3-2x} = -\\frac{1}{2}x + \\frac{3}{2}$",
                    "次の方程式、不等式を解け：$\\sqrt{3-2x} \\ge -\\frac{1}{2}x + \\frac{3}{2}$",
                    "次の方程式、不等式を解け：$\\sqrt{3x+4} < \\frac{1}{2}x + 2$",
                    "次の方程式、不等式を解け：$\\sqrt{1-2x} \\ge -x + 1$",
                    "次の関数の逆関数を求めよ：$y = -\\sqrt{1-x}$",
                    "次の関数の逆関数を求めよ：$y = \\frac{x+7}{x+1} \\quad (0 \\le x \\le 2)$",
                    "関数 $f(x) = \\sqrt{x-1}$ とその逆関数 $f^{-1}(x)$ について、$(f^{-1} \\circ f)(x) = x$ が成り立つことを示せ。",
                    "指数関数 $y = f(x)$ と対数関数 $y = g(x)$ について、合成関数 $y = (g \\circ f)(x)$ および $y = (f \\circ g)(x)$ の性質を調べよ。"
                ],
                "第1章 演習問題A": [
                    "関数 $y = \\frac{x}{x+1}$ のグラフを平行移動すると、関数 $y = \\frac{2-3x}{x-1}$ のグラフに重なる。どのように平行移動すればよいか。",
                    "関数 $y = \\frac{ax+b}{2x+1}$ のグラフが点 $(-1, 1)$ を通り、その漸近線の1つが直線 $y = 2$ であるとき、定数 $a, b$ の値を求めよ。また、この関数のグラフをかけ。",
                    "関数 $y = \\sqrt{3x+6}$ が $0 \\le x \\le a$ の範囲において最大値 $2\\sqrt{3}$ をとるように、定数 $a$ の値を定めよ。",
                    "関数 $f_1(x) = 1-x, f_2(x) = \\frac{1}{x}, f_3(x) = \\frac{x-1}{x}, f_4(x) = \\frac{x}{x-1}$ について、$(f_1 \\circ f_3)(x) = f_2(x)$ を示せ。",
                    "関数 $f_1(x) = 1-x, f_2(x) = \\frac{1}{x}, f_3(x) = \\frac{x-1}{x}, f_4(x) = \\frac{x}{x-1}$ について、$(f_4 \\circ f_2)(x) = (f_3 \\circ f_3)(x)$ を示せ。",
                    "関数 $f_1(x) = 1-x, f_2(x) = \\frac{1}{x}, f_3(x) = \\frac{x-1}{x}, f_4(x) = \\frac{x}{x-1}$ について、$f_4^{-1}(x) = f_2(x)$ を示せ。"
                ],
                "第1章 演習問題B": [
                    "$y = \\sqrt{x+1}$ のグラフと $y = x + k$ のグラフが異なる2つの共地点をもつような定数 $k$ の値の範囲を求めよ。",
                    "$a^2 + bc \\ne 0, c \\ne 0$ のとき、関数 $f(x) = \\frac{ax+b}{cx-a}$ の逆関数は、$f(x)$ に等しいことを証明せよ。",
                    "$a, b, p, q, r$ は定数で、$a \\ne 0, p \\ne 0$ とする。2つの関数 $f(x) = ax+b, g(x) = px^2 + qx + r$ について、合成関数 $(f \\circ g)(x)$ と $(g \\circ f)(x)$ が一致するとき、$a, b, p, q, r$ の満たすべき条件を求めよ。"
                ]
            },
            "第2章 極限": {
                "第1節 数列の極限": [
                    "次の数列の極限値を求めよ：$1+1, \\quad 1+\\frac{1}{2}, \\quad 1+\\frac{1}{3}, \\quad \\dots, \\quad 1+\\frac{1}{n}, \\quad \\dots$",
                    "次の数列の極限値を求めよ：$1, \\quad -\\frac{1}{2}, \\quad \\frac{1}{4}, \\quad \\dots, \\quad \\left(-\\frac{1}{2}\\right)^{n-1}, \\quad \\dots$",
                    "第 $n$ 項が次の式で表される数列の収束、発散について調べよ：$\\sqrt{n}$",
                    "第 $n$ 項が次の式で表される数列の収束、発散について調べよ：$-n^2+3$",
                    "第 $n$ 項が次の式で表される数列の収束、発散について調べよ：$1+(-1)^n$",
                    "第 $n$ 項が次の式で表される数列の収束、発散について調べよ：$1-\\frac{(-1)^n}{n}$",
                    "$\\lim_{n \\to \\infty} a_n = 3, \\lim_{n \\to \\infty} b_n = -2$ のとき、極限 $\\lim_{n \\to \\infty} (4a_n - 5b_n)$ を求めよ。",
                    "$\\lim_{n \\to \\infty} a_n = 3, \\lim_{n \\to \\infty} b_n = -2$ のとき、極限 $\\lim_{n \\to \\infty} (a_n - 1)$ を求めよ。",
                    "$\\lim_{n \\to \\infty} a_n = 3, \\lim_{n \\to \\infty} b_n = -2$ のとき、極限 $\\lim_{n \\to \\infty} \\frac{a_n}{b_n}$ を求めよ。",
                    "$\\lim_{n \\to \\infty} a_n = 3, \\lim_{n \\to \\infty} b_n = -2$ のとき、極限 $\\lim_{n \\to \\infty} \\frac{a_n + b_n}{a_n - b_n}$ を求めよ。",
                    "第 $n$ 項が $\\frac{2n-5}{n}$ で表される数列の極限を求めよ。",
                    "第 $n$ 項が $\\frac{4n^2-3n-5}{n^2}$ で表される数列の極限を求めよ。",
                    "第 $n$ 項が $\\frac{2n-1}{5n+1}$ で表される数列の極限を求めよ。",
                    "第 $n$ 項が $\\frac{3n^2-1}{2n^3+3}$ で表される数列の極限を求めよ。",
                    "第 $n$ 項が $\\frac{-4n^2-6n+1}{2n^2+5n-4}$ で表される数列の極限を求めよ。",
                    "第 $n$ 項が $\\frac{-3+7n}{4n+3n^2}$ で表される数列の極限を求めよ。",
                    "次の極限を求めよ：$\\lim_{n \\to \\infty} \\frac{2n^2-3n}{n+1}$",
                    "次の極限を求めよ：$\\lim_{n \\to \\infty} \\frac{2}{\\sqrt{n^2+3n}-n}$",
                    "次の極限を求めよ：$\\lim_{n \\to \\infty} (2n^3-4n)$",
                    "次の極限を求めよ：$\\lim_{n \\to \\infty} (7n^2-3n^3)$",
                    "次の極限を求めよ：$\\lim_{n \\to \\infty} (\\sqrt{n^2+2n}-n)$",
                    "次の極限を求めよ：$\\lim_{n \\to \\infty} (\\sqrt{n^2+n+1}-\\sqrt{n^2-n+1})$",
                    "次の極限を求めよ：$\\lim_{n \\to \\infty} \\frac{n^2+1}{2n-3}$",
                    "次の極限を求めよ：$\\lim_{n \\to \\infty} \\frac{1}{n-\\sqrt{n^2+n}}$",
                    "$\\theta$ を定数とするとき、極限 $\\lim_{n \\to \\infty} \\frac{1}{n} \\cos n\\theta$ を求めよ。",
                    "次の無限等比数列の極限を調べよ：$3, 9, 27, 81, \\dots$",
                    "次の無限等比数列の極限を調べよ：$1, \\frac{1}{\\sqrt{3}}, \\frac{1}{3}, \\frac{1}{3\\sqrt{3}}, \\dots$",
                    "次の無限等比数列の極限を調べよ：$-\\frac{2}{3}, \\frac{4}{9}, -\\frac{8}{27}, \\dots$",
                    "次の無限等比数列の極限を調べよ：$8, -12, 18, -27, \\dots$",
                    "第 $n$ 項が $\\left(\\frac{2}{3}\\right)^n$ で表される数列の極限を調べよ。",
                    "第 $n$ 項が $\\left(-\\frac{7}{5}\\right)^n$ で表される数列の極限を調べよ。",
                    "第 $n$ 項が $3\\left(-\\frac{3}{4}\\right)^{n-1}$ で表される数列の極限を調べよ。",
                    "次の極限を求めよ：$\\lim_{n \\to \\infty} \\frac{4^n+5^n}{3^n-5^{n+1}}$",
                    "次の極限を求めよ：$\\lim_{n \\to \\infty} \\frac{5^n+2^n}{3^n}$",
                    "次の極限を求めよ：$\\lim_{n \\to \\infty} \\frac{3^n-4^n}{2^{n+1}}$",
                    "無限等比数列 $2, x, \\frac{x^2}{2}, \\frac{x^3}{4}, \\dots$ が収束するような $x$ の値の範囲を求めよ。また、そのときの極限値を求めよ。",
                    "数列 $\{(x-1)^n\}$ が収束するような $x$ の値の範囲を求めよ。また、そのときの極限値を求めよ。",
                    "$r > 0$ のとき、第 $n$ 項が $\\frac{2}{3+r^n}$ で表される数列の極限を求めよ。",
                    "$r \\ne -1$ のとき、極限 $\\lim_{n \\to \\infty} \\frac{1-r^n}{1+r^n}$ を求めよ。",
                    "次の条件によって定められる数列 $\{a_n\}$ の極限を求めよ：$a_1 = 1, \\quad a_{n+1} = \\frac{2}{3}a_n - 1$",
                    "次の無限級数の収束、発散について調べ、収束すればその和を求めよ：$\\sum_{n=1}^\\infty \\frac{1}{(2n-1)(2n+1)}$",
                    "次の無限級数の収束、発散について調べ、収束すればその和を求めよ：$\\sum_{n=1}^\\infty \\frac{1}{\\sqrt{2n+1}+\\sqrt{2n-1}}$",
                    "次の無限等比級数の収束、発散について調べ、収束する場合はその和を求めよ：$1 + \\sqrt{2} + 2 + \\dots$",
                    "次の無限等比級数の収束、発散について調べ、収束する場合はその和を求めよ：$1 - \\frac{2}{3} + \\frac{4}{9} - \\dots$",
                    "次の無限等比級数の収束、発散について調べ、収束する場合はその和を求めよ：$(2+\\sqrt{3}) - (3+\\sqrt{3}) + 6 - \\dots$",
                    "次の無限等比級数の収束、発散について調べ、収束する場合はその和を求めよ：$(1+\\sqrt{2}) + \\sqrt{2} + (2\\sqrt{2}-2) + \\dots$",
                    "次の無限等比級数が収束するような実数 $x$ の値の範囲を求めよ。またその和を求めよ：$x + x(1-x)^2 + x(1-x)^4 + \\dots$",
                    "数直線上で、点Pが原点Oから出発して、正の向きに1だけ進み、負の向きに $\\frac{1}{3}$ だけ進む。以下無限に続けるとき、点Pが近づいていく点の座標を求めよ。",
                    "正三角形 $\\triangle P_1 Q_1 R_1$ の周の長さが $l$ であるとき、各辺の中点を結んで順に作られる三角形の周の長さの総和を求めよ。",
                    "次の循環小数を分数に直せ：$0.\\dot{6}$",
                    "次の循環小数を分数に直せ：$0.\\dot{4}\\dot{5}$",
                    "次の循環小数を分数に直せ：$0.3\\dot{5}\\dot{4}$",
                    "次の循環小数を分数に直せ：$0.4\\dot{7}0\\dot{2}$",
                    "次の無限級数の和を求めよ：$\\sum_{n=1}^\\infty \\left(\\frac{3}{4^n} + \\frac{1}{2^n}\\right)$",
                    "次の無限級数の和を求めよ：$\\sum_{n=1}^\\infty \\left(\\frac{2}{3^{n-1}} - \\frac{1}{2^{n-1}}\\right)$",
                    "次の無限級数の和を求めよ：$\\sum_{n=1}^\\infty \\frac{2^{n+1}+1}{3^n}$",
                    "次の無限級数の収束、発散を調べよ：$\\sum_{n=1}^\\infty (-1)^{n-1} n$",
                    "次の無限級数の収束、発散を調べよ：$\\sum_{n=1}^\\infty \\frac{2n-1}{3n}$"
                ],
                "第2節 関数の極限": [
                    "次の極限を求めよ：$\\lim_{x \\to 1} (x^3 - 2x^2)$",
                    "次の極限を求めよ：$\\lim_{x \\to -2} \\frac{x+3}{(x-1)(x^2+3)}$",
                    "次の極限を求めよ：$\\lim_{x \\to -1} \\sqrt{-3x+5}$",
                    "次の極限を求めよ：$\\lim_{x \\to 1} \\frac{x-1}{x^3-1}$",
                    "次の極限を求めよ：$\\lim_{x \\to -2} \\frac{x^3+8}{x^2-4x-12}$",
                    "次の極限を求めよ：$\\lim_{x \\to 0} \\frac{1}{x}\\left(\\frac{4}{x+2}-2\\right)$",
                    "次の極限を求めよ：$\\lim_{x \\to 0} \\frac{\\sqrt{x+9}-3}{x}$",
                    "次の極限を求めよ：$\\lim_{x \\to 1} \\frac{x-1}{\\sqrt{x}-1}$",
                    "次の極限を求めよ：$\\lim_{x \\to 1} \\frac{x-1}{\\sqrt{2x}-\\sqrt{x+1}}$",
                    "等式 $\\lim_{x \\to 0} \\frac{a\\sqrt{x+4}+b}{x} = 1$ が成り立つように、定数 $a, b$ の値を定めよ。",
                    "次の極限を求めよ：$\\lim_{x \\to 2} \\frac{1}{(x-2)^2}$",
                    "次の極限を求めよ：$\\lim_{x \\to 0} \\left(1-\\frac{1}{x^2}\\right)$",
                    "次の極限を求めよ：$\\lim_{x \\to +0} \\frac{|x|}{x}$",
                    "次の極限を求めよ：$\\lim_{x \\to 2-0} \\frac{x^2-4}{|x-2|}$",
                    "次の極限を求めよ：$\\lim_{x \\to -2+0} [x]$",
                    "次の極限を求めよ：$\\lim_{x \\to 1+0} \\frac{x}{x-1}$",
                    "次の極限を求めよ：$\\lim_{x \\to 1-0} \\frac{x}{x-1}$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} \\frac{1}{x+1}$",
                    "次の極限を求めよ：$\\lim_{x \\to -\\infty} \\left(1-\\frac{1}{x}\\right)$",
                    "次の極限を求めよ：$\\lim_{x \\to -\\infty} \\frac{1}{x^3+1}$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} (1-x^2)$",
                    "次の極限を求めよ：$\\lim_{x \\to -\\infty} (x^3+1)$",
                    "次の極限を求めよ：$\\lim_{x \\to -\\infty} (x^4-2)$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} \\frac{2x^2+3x-4}{x^2+x-5}$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} \\frac{x^2+1}{x-1}$",
                    "次の極限を求めよ：$\\lim_{x \\to -\\infty} \\frac{3x}{x^2+1}$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} (\\sqrt{x^2-2x+2}-x)$",
                    "次の極限を求めよ：$\\lim_{x \\to -\\infty} (\\sqrt{4x^2+2x}+2x)$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} 2^x$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} 3^{-x}$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} \\log_2 x$",
                    "次の極限を求めよ：$\\lim_{x \\to +0} \\log_{\\frac{1}{3}} x$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} (3^x - 2^{2x})$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} \\{\\log_2 (4x+1) - \\log_2 (x-1)\\}$",
                    "極限 $\\lim_{x \\to \\infty} \\sin \\frac{1}{x}$ を求めよ。",
                    "次の極限を求めよ：$\\lim_{x \\to -\\infty} \\sin \\frac{1}{x}$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} \\cos \\frac{1}{x}$",
                    "次の極限を求めよ：$\\lim_{x \\to 0} x \\cos \\frac{1}{x}$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} \\frac{\\sin x}{x}$",
                    "次の極限を求めよ：$\\lim_{x \\to -\\infty} \\frac{\\cos x}{x}$",
                    "次の極限を求めよ：$\\lim_{x \\to 0} \\frac{\\sin 2x}{\\sin 3x}$",
                    "次の極限を求めよ：$\\lim_{x \\to 0} \\frac{\\tan x}{x}$",
                    "次の極限を求めよ：$\\lim_{x \\to 0} \\frac{\\sin 3x}{2x}$",
                    "次の極限を求めよ：$\\lim_{x \\to 0} \\frac{\\sin 3x}{\\sin 5x}$",
                    "次の極限を求めよ：$\\lim_{x \\to 0} \\frac{1-\\cos x}{x \\sin x}$",
                    "$x - \\pi = \\theta$ とおくことにより、極限 $\\lim_{x \\to \\pi} \\frac{(x-\\pi)^2}{1+\\cos x}$ を求めよ。",
                    "次の極限を求めよ：$\\lim_{x \\to \\frac{\\pi}{2}} \\frac{\\cos x}{x - \\frac{\\pi}{2}}$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} x \\sin \\frac{1}{x}$",
                    "半径1の円の周上に定点Aがあり、Aにおける接線に点Pから垂線PQを下ろす。$\\angle AOP = \\theta$ のとき、$\\lim_{\\theta \\to +0} \\frac{\\widehat{PA}^2}{PQ}$ を求めよ。",
                    "関数 $f(x) = 1 - \\sqrt{x}$ が $x=0$ で連続であるか不連続であるかを調べよ。",
                    "関数 $f(x) = [x]$ が $x=0$ で連続であるか不連続であるかを調べよ。",
                    "関数 $f(x) = [\\cos x]$ が $x=0$ で連続であるか不連続であるかを調べよ。",
                    "関数 $y = 2x - x^2 \\quad (0 \\le x \\le 3)$ の最大値、最小値をもつか。もつならばその値を求めよ。",
                    "関数 $y = \\cos x \\quad (0 < x < 2\\pi)$ の最大値、最小値をもつか。もつならばその値を求めよ。",
                    "方程式 $2^x - 3x = 0$ は、$3 < x < 4$ の範囲に少なくとも1つの実数解をもつことを示せ。"
                ],
                "第2章 問題": [
                    "次の数列の収束、発散について調べ、極限があれば求めよ：$\\{\\sqrt{n}(\\sqrt{n+1}-\\sqrt{n})\\}$",
                    "次の数列の収束、発散について調べ、極限があれば求めよ：$\\left\\{\\frac{\\sqrt{n+2}-\\sqrt{n-1}}{\\sqrt{n+1}-\\sqrt{n}}\\right\\}$",
                    "次の数列の収束、発散について調べ、極限があれば求めよ：$\\{4^n - 3^n\\}$",
                    "次の数列の収束、発散について調べ、極限があれば求めよ：$\\left\\{\\frac{(-2)^{n+1}-3^n}{4^n}\\right\\}$",
                    "数列 $\\left\\{ \\frac{r^{2n}-1}{r^{2n}+1} \\right\\}$ の極限を求めよ。",
                    "次の条件によって定義される数列 $\{a_n\}$ の極限を求めよ：$a_1 = 1, \\quad a_{n+1} = 4 - \\frac{1}{3}a_n$",
                    "次の条件によって定義される数列 $\{a_n\}$ の極限を求めよ：$a_1 = 3, \\quad a_{n+1} = 2a_n - 6$",
                    "初項1, 公比0.5の無限等比級数において、和 $S$ と部分和 $S_n$ の差が、初めて $0.001$ より小さくなるような $n$ の値を求めよ。",
                    "次の無限等比級数の収束、発散を調べ、収束する場合はその和を求めよ：$(\\sqrt{3}-1) + 2(2-\\sqrt{3}) + 2(3\\sqrt{3}-5) + \\dots$",
                    "点Pが原点Oから出発して、$x$ 軸方向に1、$y$ 軸方向に $\\frac{1}{2}$、$x$ 軸方向に $\\frac{1}{2^2} \\dots$ と進むとき、点Pが近づく点の座標を求めよ。",
                    "無限等比数列 $\{r^{n-1}\}$ が収束する条件と、無限等比級数 $\\sum r^{n-1}$ が収束する条件を場合分けして求めよ。",
                    "次の極限を求めよ：$\\lim_{x \\to 1} \\frac{x^3-2x^2+1}{x^2-3x+2}$",
                    "次の極限を求めよ：$\\lim_{x \\to 0} \\frac{x}{\\sqrt{1+x}-\\sqrt{1-x}}$",
                    "次の極限を求めよ：$\\lim_{x \\to 1} \\frac{\\sqrt{x+3}-2}{x^2-1}$",
                    "関数 $f(x) = \\frac{\\sqrt{ax+1}-3}{x-2}$ が $x \\to 2$ のとき収束するように、定数 $a$ の値を定めよ。またそのときの極限値を求めよ。",
                    "次の極限を求めよ：$\\lim_{x \\to -\\infty} (x^3-2x+3)$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} \\frac{2^x-1}{2^x+1}$",
                    "次の極限を求めよ：$\\lim_{x \\to -\\infty} (\\sqrt{x^2+1}+x)$",
                    "次の極限を求めよ：$\\lim_{x \\to \\infty} (\\sqrt{x^2+2x-1}-x+1)$",
                    "次の極限を求めよ：$\\lim_{x \\to 0} \\frac{\\tan x}{\\sin 3x}$",
                    "次の極限を求めよ：$\\lim_{x \\to 0} \\frac{1-\\cos x}{x}$",
                    "半径 $r$ の円Oの周上に中心角 $\\theta$ に対する弧ABをとり、弧ABを2等分する点をCとする。線分OCと弦ABの交点をDとするとき、極限 $\\lim_{\\theta \\to +0} \\frac{\\text{弧}AB}{\\text{弦}AB}$ を求めよ。",
                    "半径 $r$ の円Oの周上に中心角 $\\theta$ に対する弧ABをとり、弧ABを2等分する点をCとする。線分OCと弦ABの交点をDとするとき、極限 $\\lim_{\\theta \\to +0} \\frac{CD}{\\text{弦}AB}$ を求めよ。",
                    "方程式 $(x^2-1)\\cos x + \\sqrt{2}\\sin x - 1 = 0$ は、$0 < x < \\frac{\\pi}{2}$ の範囲に少なくとも1つの実数解をもつことを示せ。",
                    "半径 $r$ の円に内接する正 $n$ 角形の面積を $S_n$ とするとき、$S_n$ を表し、$\\lim_{n \\to \\infty} S_n$ を求めよ。"
                ],
                "第2章 演習問題A": [
                    "次の極限を求めよ：$\\lim_{n \\to \\infty} \\frac{1+2+2^2+\\dots+2^{n-1}}{3^n}$",
                    "次の極限を求めよ：$\\lim_{n \\to \\infty} \\frac{n^3}{1^2+2^2+3^2+\\dots+n^2}$",
                    "不等式 $2^n \\ge 1 + n + \\frac{n(n-1)}{2}$ を用いて、極限 $\\lim_{n \\to \\infty} \\frac{n}{2^n}$ を求めよ。",
                    "$a > 0, a \\ne 1$ のとき、極限 $\\lim_{x \\to \\infty} \\frac{a^{x-1}}{1+a^x}$ を求めよ。",
                    "$a > 0, a \\ne 1$ のとき、極限 $\\lim_{x \\to \\infty} \\{\\log_a x - \\log_a (x-1)\\}$ を求めよ。",
                    "放物線 $y = x^2$ 上の点Pと $x$ 軸上の点Qが $OP = OQ$ を保ちながら原点に近づくとき、直線PQと $y$ 軸の交点Rの極限位置を求めよ。"
                ],
                "第2章 演習問題B": [
                    "数列 $\{a_n\}$ が $a_1 = \\frac{3}{2}, a_{n+1} = \\frac{2}{3-a_n}$ で定義されるとき、一般項を推測・証明し、極限を求めよ。",
                    "次の無限級数の和 $f(x)$ のグラフをかけ。また不連続となる $x$ の値を求めよ：$x^2 + \\frac{x^2}{1+x^2} + \\frac{x^2}{(1+x^2)^2} + \\dots$"
                ]
            },
            "第3章 微分法": {
                "第1節 導関数": [
                    "関数 $f(x) = x^3 - 2x$ のグラフ上の点 $(1, -1)$ における接線の傾きを求めよ。",
                    "関数 $f(x) = |x^2-1|$ は $x=1$ で微分可能でないことを示せ。",
                    "次の関数を導関数の定義に従って微分せよ：$f(x) = \\frac{1}{x}$",
                    "次の関数を導関数の定義に従って微分せよ：$f(x) = \\sqrt{2x-1}$",
                    "公式 $\{k f(x)\}' = k f'(x)$ を証明せよ。",
                    "次の関数を微分せよ：$y = -x^3 - 7x^2 + 2x + 4$",
                    "次の関数を微分せよ：$y = 2x^4 - 3x^2 + 1$",
                    "次の関数を微分せよ：$y = (2x+1)(x^2-x+3)$",
                    "次の関数を微分せよ：$y = (2x^3+1)(3x^4-1)$",
                    "次の関数を微分せよ：$y = \\frac{2}{2x-1}$",
                    "次の関数を微分せよ：$y = \\frac{x}{x^2-1}$",
                    "次の関数を微分せよ：$y = \\frac{x^2+2x+2}{x+1}$",
                    "公式 $(x^n)' = n x^{n-1}$ を用いて、関数 $y = \\frac{1}{x}$ を微分せよ。",
                    "次の関数を微分せよ：$y = \\frac{1}{x^2}$",
                    "次の関数を微分せよ：$y = \\frac{1}{3x^3}$",
                    "次の関数を微分せよ：$y = x + \\frac{1}{x}$",
                    "微分可能な関数 $f(x), g(x)$ について、等式 $\\frac{d}{dx} f(ax+b) = a f'(ax+b)$ を証明せよ。",
                    "微分可能な関数 $f(x), g(x)$ について、等式 $\\frac{d}{dx} \\{g(x)\\}^n = n \\{g(x)\\}^{n-1} g'(x)$ を証明せよ。",
                    "次の関数を微分せよ：$y = (3x+1)^4$",
                    "次の関数を微分せよ：$y = (3-2x^2)^3$",
                    "次の関数を微分せよ：$y = \\frac{1}{(x^2+1)^3}$",
                    "逆関数の微分法を用いて、次の関数を微分せよ：$y = x^{\\frac{1}{6}}$",
                    "逆関数の微分法を用いて、次の関数を微分せよ：$y = \\sqrt{x}$",
                    "次の関数を微分せよ：$y = \\sqrt{x^3}$",
                    "次の関数を微分せよ：$y = \\sqrt[4]{2x-3}$",
                    "次の関数を微分せよ：$y = \\sqrt[3]{x^2+x+1}$"
                ],
                "第2節 いろいろな関数の導関数": [
                    "次の関数を微分せよ：$y = \\sin^2 x$",
                    "次の関数を微分せよ：$y = \\cos\\left(\\frac{x}{2}+\\frac{\\pi}{6}\\right)$",
                    "次の関数を微分せよ：$y = \\tan 3x$",
                    "次の関数を微分せよ：$y = \\sqrt{1+\\sin x}$",
                    "次の関数を微分せよ：$y = \\frac{1}{1+\\cos x}$",
                    "次の関数を微分せよ：$y = \\tan^2 2x$",
                    "関数 $y = x \\cos x - \\sin x$ を微分せよ。",
                    "次の関数を微分せよ：$y = \\log 5x$",
                    "次の関数を微分せよ：$y = \\log_3 (2x-1)$",
                    "次の関数を微分せよ：$y = x^2 \\log x$",
                    "次の関数を微分せよ：$y = (\\log x)^2$",
                    "次の関数を微分せよ：$y = \\log|2x+3|$",
                    "次の関数を微分せよ：$y = \\log_2 |x^2-4|$",
                    "次の関数を微分せよ：$y = \\log|\\sin x|$",
                    "次の関数を微分せよ：$y = \\log|3x-1|$",
                    "次の関数を微分せよ：$y = \\log_{10} |2x|$",
                    "次の関数を微分せよ：$y = \\log_3 |x^2-9|$",
                    "次の関数を微分せよ：$y = \\log|\\cos x|$",
                    "次の関数を微分せよ：$y = \\log\\left|\\frac{x-1}{x+1}\\right|$",
                    "次の関数を微分せよ：$y = \\frac{(x+1)^3}{(x-1)(x+2)^2}$",
                    "次の関数を微分せよ：$y = \\frac{\\sqrt{x+2}}{x+1}$",
                    "次の関数を微分せよ ($a>0, a \\ne 1$)：$y = e^{3x}$",
                    "次の関数を微分せよ ($a>0, a \\ne 1$)：$y = 3^{-x}$",
                    "次の関数を微分せよ ($a>0, a \\ne 1$)：$y = e^{x^2}$",
                    "次の関数を微分せよ ($a>0, a \\ne 1$)：$y = (x-1)e^x$",
                    "次の関数の第2次導関数、第3次導関数を求めよ：$y = 2x^3 - 3x^2 + 4x - 1$",
                    "次の関数の第2次導関数、第3次導関数を求めよ：$y = \\sin x$",
                    "次の関数の第2次導関数、第3次導関数を求めよ：$y = e^x$",
                    "次の関数の第2次導関数、第3次導関数を求めよ：$y = \\log x$",
                    "次の関数の第 $n$ 次導関数を求めよ：$y = e^{2-x}$",
                    "次の関数の第 $n$ 次導関数を求めよ：$y = x^n$",
                    "次の関数の第 $n$ 次導関数を求めよ：$y = x e^x$",
                    "関数 $y = e^{-x} \\cos x$ は、等式 $y'' + 2y' + 2y = 0$ を満たすことを示せ。",
                    "$y^2 = 4x$ のとき、$\\frac{dy}{dx}$ を求めよ。",
                    "次の方程式で定められる $x$ の関数 $y$ について $\\frac{dy}{dx}$ を求めよ：$x^2 + y^2 + 2x - 4 = 0$",
                    "次の方程式で定められる $x$ の関数 $y$ について $\\frac{dy}{dx}$ を求めよ：$\\frac{x^2}{16} + \\frac{y^2}{9} = 1$",
                    "次の方程式で定められる $x$ の関数 $y$ について $\\frac{dy}{dx}$ を求めよ：$9x^2 - 4y^2 = -36$",
                    "媒介変数 $t$ を用いて $x = 3t-2, \\; y = t^2+1$ と表されるとき、導関数 $\\frac{dy}{dx}$ を $t$ の関数として表せ。",
                    "媒介変数 $t$ を用いて $x = 2\\cos t, \\; y = 2\\sin t$ と表されるとき、導関数 $\\frac{dy}{dx}$ を $t$ の関数として表せ。",
                    "媒介変数 $t$ を用いて $x = \\frac{2}{\\cos t}, \\; y = \\tan t$ と表されるとき、導関数 $\\frac{dy}{dx}$ を $t$ の関数として表せ。"
                ],
                "第3章 問題": [
                    "関数 $y = x\\sqrt{x}$ を、導関数の定義に従って微分せよ。",
                    "次の関数を微分せよ：$y = (x^3-1)(x^2-2)$",
                    "次の関数を微分せよ：$y = (2x+1)(3x^4-x^3+2)$",
                    "次の関数を微分せよ：$y = \\frac{1}{x^2+1}$",
                    "次の関数を微分せよ：$y = \\frac{x^2}{x^2-4}$",
                    "次の関数を微分せよ：$y = \\frac{x^2}{x+2}$",
                    "次の関数を微分せよ：$y = \\frac{3x^2-2x+5}{\\sqrt{x}}$",
                    "関数 $f(x), g(x), h(x)$ が微分可能であるとき、$y = f(x)g(x)h(x)$ の導関数が $y' = f'gh + fg'h + fgh'$ となることを示し、$y = (x+1)(x-2)(x+3)$ を微分せよ。",
                    "次の関数を微分せよ：$y = (x^2+2x-1)^2$",
                    "次の関数を微分せよ：$y = \\frac{1}{(3x-2)^2}$",
                    "次の関数を微分せよ：$y = \\sqrt[3]{2x^2+5}$",
                    "関数 $f(x)$ が $x=a$ で微分可能であるとき、極限 $\\lim_{h \\to 0} \\frac{f(a+2h)-f(a)}{h}$ を $f'(a)$ を用いて表せ。",
                    "関数 $f(x)$ が $x=a$ で微分可能であるとき、極限 $\\lim_{h \\to 0} \\frac{f(a-h)-f(a)}{h}$ を $f'(a)$ を用いて表せ。",
                    "関数 $f(x)$ が $x=a$ で微分可能であるとき、極限 $\\lim_{h \\to 0} \\frac{f(a+h)-f(a-h)}{h}$ を $f'(a)$ を用いて表せ。",
                    "次の関数を微分せよ：$y = \\frac{1}{\\sin x}$",
                    "次の関数を微分せよ：$y = \\cos^3 2x$",
                    "次の関数を微分せよ：$y = \\frac{e^x}{e^x+1}$",
                    "次の関数を微分せよ：$y = x(\\log x - 1)$",
                    "次の関数を微分せよ：$y = \\log(x+\\sqrt{x^2+1})$",
                    "次の関数を微分せよ：$y = e^x \\log x$",
                    "次の関数を微分せよ：$y = \\sqrt[3]{(x+2)(x^2+2)}$",
                    "次の関数を微分せよ：$y = x e^{-2x}$",
                    "次の関数を微分せよ：$y = 2^{\\log x}$",
                    "次の関数を微分せよ：$y = x^2 (\\log x)^3$",
                    "次の関数を微分せよ：$y = \\frac{\\cos x}{1+\\sin x}$",
                    "次の関数を微分せよ：$y = \\frac{1-\\tan x}{1+\\tan x}$",
                    "次の関数を微分せよ：$y = \\frac{e^x - e^{-x}}{e^x + e^{-x}}$",
                    "次の関数の第3次までの導関数を求めよ：$y = \\sqrt{x}$",
                    "次の関数の第3次までの導関数を求めよ：$y = x \\sin x$",
                    "次の関数の第3次までの導関数を求めよ：$y = \\log|\\cos x|$",
                    "関数 $y = e^{-2x} \\sin 2x$ は、等式 $y'' + 4y' + 8y = 0$ を満たすことを示せ。",
                    "$x^{\\frac{2}{3}} + y^{\\frac{2}{3}} = 1$ であるとき、$\\frac{dy}{dx} = -\\left(\\frac{y}{x}\\right)^{\\frac{1}{3}}$ であることを示せ。"
                ],
                "第3章 演習問題A": [
                    "次の関数を微分せよ：$y = \\left(\\frac{x^2-1}{x^2+1}\\right)^2$",
                    "次の関数を微分せよ：$y = (x-1)^2 \\sqrt[3]{x+2}$",
                    "関数 $y = \\sin x$ について、等式 $y^{(n)} = \\sin\\left(x+\\frac{n\\pi}{2}\\right)$ が成り立つことを証明せよ。",
                    "次の極限を求めよ：$\\lim_{x \\to 0} \\frac{e^x-1}{x}$",
                    "次の極限を求めよ：$\\lim_{x \\to 1} \\frac{\\log x}{x-1}$",
                    "$1+x+x^2+\\dots+x^n = \\frac{1-x^{n+1}}{1-x}$ の両辺を微分することにより、$1+2x+3x^2+\\dots+n x^{n-1}$ を求めよ。",
                    "$x = t - \\sin t, y = 1 - \\cos t$ であるとき、$\\frac{dy}{dx}, \\frac{d^2 y}{dx^2}$ を $t$ の関数として表せ。"
                ],
                "第3章 演習問題B": [
                    "関数 $y = \\tan x \\left(-\\frac{\\pi}{2} < x < \\frac{\\pi}{2}\\right)$ の逆関数を $f(x)$ とするとき、導関数 $f'(x)$ を求めよ。",
                    "次の関数を微分せよ：$y = x^x \\quad (x>0)$"
                ]
            },
            "第4章 微分法の応用": {
                "第1節 導関数の応用": [
                    "次の曲線上の点Aにおける接線の方程式を求めよ：$y = \\frac{2}{x}, \\quad A(-1, -2)$",
                    "次の曲線上の点Aにおける接線の方程式を求めよ：$y = \\sin x, \\quad A\\left(\\frac{\\pi}{6}, \\frac{1}{2}\\right)$",
                    "次の曲線上の点Aにおける法線の方程式を求めよ：$y = e^x, \\quad A(-1, e^{-1})$",
                    "次の曲線上の点Aにおける法線の方程式を求めよ：$y = \\tan x, \\quad A\\left(\\frac{\\pi}{4}, 1\\right)$",
                    "曲線 $y = \\frac{1}{x}$ について、傾きが $-4$ の接線の方程式と接点の座標を求めよ。",
                    "曲線 $y = \\frac{1}{x}$ について、点 $(3, -1)$ を通る接線の方程式と接点の座標を求めよ。",
                    "曲線 $y = x \\log x$ について、傾きが 1 の接線の方程式と接点の座標を求めよ。",
                    "曲線 $y = x \\log x$ について、点 $(0, -2)$ を通る接線の方程式と接点の座標を求めよ。",
                    "2つの曲線 $y = x^2 - 3, y = \\frac{a}{x}$ が共地点Pで共通の接線をもつとき、定数 $a$ の値とPの座標を求めよ。",
                    "次の曲線上の点Aにおける接線と法線の方程式を求めよ：$\\frac{x^2}{12} + \\frac{y^2}{4} = 1, \\quad A(3, 1)$",
                    "次の曲線上の点Aにおける接線と法線の方程式を求めよ：$xy = 8, \\quad A(2, 4)$",
                    "放物線 $y^2 = 4px$上の点 $A(x_1, y_1)$ における接線は $y_1 y = 2p(x+x_1)$ であることを示せ。",
                    "楕円 $\\frac{x^2}{a^2} + \\frac{y^2}{b^2} = 1$ 上の点 $A(x_1, y_1)$ における接線は $\\frac{x_1 x}{a^2} + \\frac{y_1 y}{b^2} = 1$ であることを示せ。",
                    "方程式 $f(x)=0$ が重解をもつ条件について調べよ。",
                    "次の関数と示された区間について平均値の定理を満たす $c$ の値を求めよ：$f(x) = x^3 - 3x^2 \\quad [-2, 1]$",
                    "次の関数と示された区間について平均値の定理を満たす $c$ の値を求めよ：$f(x) = e^x \\quad [0, 1]$",
                    "平均値の定理を用いて、$a < b$ のとき $e^a < \\frac{e^b - e^a}{b-a} < e^b$ を証明せよ。",
                    "指数関数 $y = a^x$ は、$a>1$ のとき単調増加、$0<a<1$ のとき単調減少することを示せ。",
                    "$g'(x) = f'(x)$ ならば $g(x) = f(x) + C$ であることを証明せよ。",
                    "次の関数の増減を調べよ：$y = x + \\sin x \\quad (0 \\le x \\le 2\\pi)$",
                    "次の関数の増減を調べよ：$y = e^x - x$",
                    "次の関数の増減を調べよ：$y = x - \\log x$",
                    "次の関数の極値を求めよ：$y = \\frac{x}{x^2+1}$",
                    "次の関数の極値を求めよ：$y = \\sin^2 x + 2\\sin x \\quad (0 < x < 2\\pi)$",
                    "次の関数の極値を求めよ：$y = x^2 \\log x$",
                    "次の関数の極値を求めよ：$y = x e^{-x}$",
                    "次の関数の極値を求めよ：$y = |x-3|\\sqrt{x}$",
                    "次の関数の極値を求めよ：$y = |x^2-2x| + 3$",
                    "関数 $f(x) = (ax+1)e^x$ が $x=0$ で極値をとるように定数 $a$ の値を定めよ。",
                    "次の関数の最大値、最小値を求めよ：$y = x\\sqrt{4-x^2}$",
                    "次の関数の最大値、最小値を求めよ：$y = x \\sin x + \\cos x \\quad (0 \\le x \\le 2\\pi)$",
                    "二等辺三角形ABCが半径1の円に内接している。周の長さの最大値を求めよ。",
                    "次の曲線の凹凸を調べ、変曲点を求めよ：$y = x^4 + 2x^3 + 1$",
                    "次の曲線の凹凸を調べ、変曲点を求めよ：$y = x + \\cos 2x \\quad (0 < x < \\pi)$",
                    "次の曲線の凹凸を調べ、変曲点を求めよ：$y = x e^x$",
                    "次の関数のグラフの概形をかけ：$y = x^2(x^2-4)$",
                    "次の関数のグラフの概形をかけ：$y = x + 2\\cos x \\quad (0 \\le x \\le 2\\pi)$",
                    "次の関数のグラフの概形をかけ：$y = e^{-\\frac{x^2}{2}}$",
                    "次の関数のグラフの概形をかけ：$y = \\frac{4x}{x^2+1}$",
                    "次の関数のグラフの概形をかけ：$y = \\frac{x^2-x+4}{x}$",
                    "第2次導関数を利用して次の関数の極値を求めよ：$f(x) = 3x^4 - 4x^3 - 12x^2$",
                    "第2次導関数を利用して次の関数の極値を求めよ：$f(x) = \\sqrt{3}x + 2\\cos x \\quad (0 < x < \\pi)$",
                    "$x > 0$ のとき、不等式 $\\log(x+1) < x$ が成り立つことを証明せよ。",
                    "$x > 0$ のとき、不等式 $e^x > 1 + x + \\frac{x^2}{2}$ が成り立つことを証明せよ。",
                    "$a$ は定数とする。方程式 $\\log x - x = a$ の異なる実数解の個数を求めよ。",
                    "$a$ は定数とする。方程式 $x e^x = a$ の異なる実数解の個数を求めよ。"
                ],
                "第2節 速度と近似式": [
                    "真上に投げ上げた物体の位置 $x = v_0 t - \\frac{1}{2}gt^2$ における速度と加速度を求めよ。",
                    "点Pの座標 $(x,y)$ が $x = 3t, \\; y = -t^2+t$ で表されるとき、$t=2$ における速さと加速度の大きさを求めよ。",
                    "点Pの座標 $(x,y)$ が $x = 2\\cos \\pi t, \\; y = 2\\sin \\pi t$ で表されるとき、$t=2$ における速さと加速度の大きさを求めよ。",
                    "等速円運動において、速度ベクトルと加速度ベクトルが垂直であることを示せ。",
                    "点Pの座標がサイクロイドで表されるとき、$t=1, t=2$ における速さを求めよ。",
                    "$x$ が十分小さいとき、$(1+x)^p \\approx 1 + px$ を示せ。",
                    "$x$ が十分小さいとき、関数 $\\sqrt{1+x}$ の1次の近似式を作れ。",
                    "$x$ が十分小さいとき、関数 $e^x$ の1次の近似式を作れ。",
                    "$x$ が十分小さいとき、関数 $\\log_{10}(2+x)$ の1次の近似式を作れ。",
                    "次の数の近似値を求めよ（$\\sqrt{3} \\approx 1.732, \\pi \\approx 3.142$）：$\\sqrt{100.5}$",
                    "次の数の近似値を求めよ（$\\sqrt{3} \\approx 1.732, \\pi \\approx 3.142$）：$\\sqrt[3]{7.9}$",
                    "次の数の近似値を求めよ（$\\sqrt{3} \\approx 1.732, \\pi \\approx 3.142$）：$\\sin 29^\\circ$"
                ],
                "第4章 問題": [
                    "接線および法線の方程式を求めよ：$y = \\cos x, \\quad P\\left(\\frac{\\pi}{4}, \\frac{1}{\\sqrt{2}}\\right)$",
                    "接線および法線の方程式を求めよ：$x^{\\frac{2}{3}} + y^{\\frac{2}{3}} = 5, \\quad P(8, 1)$",
                    "接線および法線の方程式を求めよ：$x = 2\\cos\\theta, y = 2\\sin\\theta \\quad (\\theta = \\frac{3}{4}\\pi)$",
                    "次の関数の極値を求めよ：$y = \\sqrt[3]{x^2}$",
                    "次の関数の極値を求めよ：$y = x^2 + \\log(9-x^2)$",
                    "次の関数の極値を求めよ：$y = x + \\sqrt{3}\\sin x - \\cos x \\quad (0 < x < 2\\pi)$",
                    "次の関数の最大値、最小値を求めよ：$y = \\frac{\\log x}{x^2} \\quad (1 \\le x \\le 3)$",
                    "次の関数の最大値、最小値を求めよ：$y = (1-2x)e^{-2x} \\quad (0 \\le x \\le 3)$",
                    "曲線 $y = x^4 + ax^3 + 3ax^2 + 1$ が変曲点をもつような定数 $a$ の範囲を求めよ。",
                    "次の関数のグラフの概形をかけ：$y = \\frac{2x^2+x+1}{x+1}$",
                    "次の関数のグラフの概形をかけ：$y = \\frac{(x-1)^2}{x^2+1}$",
                    "$x > 0$ のとき、$x - \\frac{x^2}{2} < \\log(1+x)$ を証明せよ。",
                    "方程式 $x^2 = a e^x$ が異なる3個の実数解をもつような定数 $a$ の範囲を求めよ。"
                ],
                "第4章 演習問題A": [
                    "2つの曲線 $y = x^2+ax+b, y = \\frac{8}{x}$ が点 $(2,4)$ で直交するとき，$a, b$ を求めよ。",
                    "関数 $f(x) = \\frac{e^x}{\\sin x} \\quad (0 < x < 2\\pi)$ の極値を求めよ。",
                    "放物線上の接線と座標軸が作る三角形の面積の最小値を求めよ。",
                    "曲線 $y = \\frac{x}{x^2+a}$ の変曲点の個数を調べよ。"
                ],
                "第4章 演習問題B": [
                    "関数 $y = \\tan x \\left(-\\frac{\\pi}{2} < x < \\frac{\\pi}{2}\\right)$ の逆関数を $f(x)$ とするとき、導関数 $f'(x)$ を求めよ。",
                    "次の関数を微分せよ：$y = x^x \\quad (x>0)$"
                ]
            },
            "第5章 積分法": {
                "第1節 不定積分": [
                    "次の不定積分を求めよ：$\\int x^4 dx$",
                    "次の不定積分を求めよ：$\\int \\frac{dy}{y^5}$",
                    "次の不定積分を求めよ：$\\int x^{\\frac{1}{3}} dx$",
                    "次の不定積分を求めよ：$\\int \\sqrt[4]{t} dt$",
                    "次の不定積分を求めよ：$\\int x\\sqrt{x} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{dx}{\\sqrt{x}}$",
                    "次の不定積分を求めよ：$\\int \\frac{(x-2)(x^2-3)}{x^3} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{(\\sqrt{x}+1)^3}{x} dx$",
                    "次の不定積分を求めよ：$\\int \\left(3x^2-\\frac{1}{x}\\right)^2 dx$",
                    "次の不定積分を求めよ：$\\int \\frac{2x-3x^2}{\\sqrt{x}} dx$",
                    "次の不定積分を求めよ：$\\int (5\\cos x - 3\\sin x) dx$",
                    "次の不定積分を求めよ：$\\int (3-\\tan x)\\cos x dx$",
                    "次の不定積分を求めよ：$\\int \\frac{\\cos^3 x + 2}{\\cos^2 x} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{dx}{\\tan^2 x}$",
                    "次の不定積分を求めよ：$\\int (3^x + e^x) dx$",
                    "次の不定積分を求めよ：$\\int (3e^x - x^3) dx$",
                    "次の不定積分を求めよ：$\\int (10^x - 7^x) dx$",
                    "次の不定積分を求めよ：$\\int (5^x \\log 5 + x^4) dx$",
                    "次の不定積分を求めよ：$\\int (x-1)^4 dx$",
                    "次の不定積分を求めよ：$\\int (2-3x)^3 dx$",
                    "次の不定積分を求めよ：$\\int \\frac{2}{2x+1} dx$",
                    "次の不定積分を求めよ：$\\int \\sqrt{4x-3} dx$",
                    "次の不定積分を求めよ：$\\int \\sin(-5x+1) dx$",
                    "次の不定積分を求めよ：$\\int 2^{3x-1} dx$",
                    "次の不定積分を求めよ：$\\int x\\sqrt{2x+1} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{x}{\\sqrt{1-x}} dx$",
                    "次の不定積分を求めよ：$\\int 3x^2 \\sqrt{x^3+2} dx$",
                    "次の不定積分を求めよ：$\\int x\\sqrt{1-x^2} dx$",
                    "次の不定積分を求めよ：$\\int \\sin^3 x \\cos x dx$",
                    "次の不定積分を求めよ：$\\int \\frac{\\tan x}{\\cos^2 x} dx$",
                    "次の不定積分を求めよ：$\\check \\int \\frac{\\log x}{x} dx$",
                    "次の不定積分を求めよ：$\\int x^2 e^{x^3} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{2x+1}{x^2+x+1} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{dx}{\\tan x}$",
                    "次の不定積分を求めよ：$\\int \\frac{e^x}{e^x-1} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{\\sin x}{1+\\cos x} dx$",
                    "次の不定積分を求めよ：$\\int x \\cos x dx$",
                    "次の不定積分を求めよ：$\\int (2x-1) \\log x dx$",
                    "次の不定積分を求めよ：$\\int (x+1) e^x dx$",
                    "不定積分 $\\int \\log(x+1) dx$ を求めよ。",
                    "不定積分 $\\int (x^2+1) \\sin x dx$ を求めよ。",
                    "$\\frac{x}{(x+1)(x+2)} = \\frac{a}{x+1} + \\frac{b}{x+2}$ が成り立つように $a, b$ を定め、不定積分を求めよ。",
                    "次の不定積分を求めよ：$\\int \\frac{3x-5}{x-2} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{dx}{x(x-1)}$",
                    "次の不定積分を求めよ：$\\int \\frac{x-3}{x^2-1} dx$",
                    "次の不定積分を求めよ：$\\int \\cos^2 x dx$",
                    "次の不定積分を求めよ：$\\int \\sin^2 3x dx$",
                    "次の不定積分を求めよ：$\\int \\sin x \\cos x dx$",
                    "次の不定積分を求めよ：$\\int \\sin 4x \\cos 2x dx$",
                    "次の不定積分を求めよ：$\\int \\cos 2x \\cos 3x dx$",
                    "次の不定積分を求めよ：$\\int \\sin 3x \\sin x dx$",
                    "次の不定積分を求めよ：$\\int \\sin^3 x dx$",
                    "次の不定積分を求めよ：$\\int \\frac{\\sin^3 x}{\\cos^2 x} dx$",
                    "不定積分 $\\int \\frac{dx}{\\cos x}$ を求めよ。"
                ],
                "第2節 定積分": [
                    "次の定積分を求めよ：$\\int_1^e \\frac{dx}{x}$",
                    "次の定積分を求めよ：$\\int_1^2 \\frac{dy}{y^3}$",
                    "次の定積分を求めよ：$\\int_0^{\\frac{\\pi}{4}} \\frac{d\\theta}{\\cos^2 \\theta}$",
                    "次の定積分を求めよ：$\\int_{-3}^0 2^x dx$",
                    "次の定積分を求めよ：$\\int_0^1 (e^x - e^{-x}) dx$",
                    "次の定積分を求めよ：$\\int_1^2 \\frac{dx}{x(x-3)}$",
                    "次の定積分を求めよ：$\\int_0^\\pi \\cos x \\sin 4x dx$",
                    "次の定積分を求めよ：$\\int_0^{\\frac{\\pi}{4}} \\sin^2 x dx$",
                    "次の定積分を求めよ：$\\int_0^{2\\pi} |\\sin x| dx$",
                    "次の定積分を求めよ：$\\int_0^4 |\\sqrt{x}-1| dx$",
                    "次の定積分を求めよ：$\\int_0^1 |e^x - 2| dx$",
                    "次の定積分を求めよ：$\\int_0^1 \\frac{x-1}{(2-x)^2} dx$",
                    "次の定積分を求めよ：$\\int_1^2 x\\sqrt{2-x} dx$",
                    "次の定積分を求めよ：$\\int_0^{\\frac{\\pi}{2}} (1+\\cos^2 x)\\sin x dx$",
                    "次の定積分を求めよ：$\\int_{-1}^1 \\sqrt{1-x^2} dx$",
                    "次の定積分を求めよ：$\\int_{-1}^{\\sqrt{3}} \\sqrt{4-x^2} dx$",
                    "次の定積分を求めよ：$\\int_0^{\\frac{1}{2}} \\frac{dx}{\\sqrt{1-x^2}}$",
                    "次の定積分を求めよ：$\\int_0^{\\sqrt{3}} \\frac{dx}{x^2+1}$",
                    "次の定積分を求めよ：$\\int_{-2}^2 \\frac{dx}{x^2+4}$",
                    "次の定積分を求めよ：$\\int_{-3}^{\\sqrt{3}} \\frac{dx}{x^2+9}$",
                    "次の定積分を求めよ：$\\int_{-1}^1 (1+x^2)(x-3) dx$",
                    "次の定積分を求めよ：$\\int_{-2}^2 x\\sqrt{4-x^2} dx$",
                    "次の定積分を求めよ：$\\int_0^\\pi x \\sin x dx$",
                    "次の定積分を求めよ：$\\int_0^1 x e^x dx$",
                    "次の定積分を求めよ：$\\int_1^2 x \\log x dx$",
                    "次の定積分を求めよ：$\\int_e^{2e} \\log x dx$",
                    "次の定積分を求めよ：$\\int_0^{\\frac{\\pi}{2}} x^2 \\sin x dx$",
                    "部分積分法によって、次の定積分を求めよ：$\\int_0^1 x(x-1)^2 dx$",
                    "部分積分法によって、次の定積分を求めよ：$\\int_\\alpha^\\beta (x-\\alpha)(x-\\beta) dx$",
                    "関数 $F(x) = \\int_a^x (x-t)e^t dt$ を $x$ について微分せよ。",
                    "関数 $y = \\int_x^{2x} t \\cos t dt$ を $x$ について微分せよ。",
                    "等式 $f(x) = \\sin x + \\int_0^{\\frac{\\pi}{2}} f(t) dt$ を満たす関数 $f(x)$ を求めよ。",
                    "極限値 $S = \\lim_{n \\to \\infty} \\frac{1}{n} \\left(\\sin\\frac{\\pi}{n} + \\sin\\frac{2\\pi}{n} + \\dots + \\sin\\frac{n\\pi}{n}\\right)$ を求めよ。",
                    "$x \\ge 1$ のとき $\\frac{1}{x^2} \\le \\frac{1}{x^2-x+1} \\le \\frac{1}{x}$ を証明し、これを用いて $\\frac{1}{2} < \\int_1^2 \\frac{dx}{x^2-x+1} < \\log 2$ を示せ。",
                    "不等式 $1 + \\frac{1}{2} + \\frac{1}{3} + \\dots + \\frac{1}{n} < 1 + \\log n$ を証明せよ。（$n$ は2以上の自然数）"
                ],
                "第5章 問題": [
                    "条件 $F'(x) = (x^2-1)\\sqrt{x}, F(1) = 0$ を満たす関数 $F(x)$ を求めよ。",
                    "次の不定積分を求めよ：$\\int \\frac{x-1}{\\sqrt{x}} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{e^{2x}-e^{-2x}}{e^x+e^{-x}} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{dx}{(1-x)^2}$",
                    "次の不定積分を求めよ：$\\int (3-2x)^{\\frac{1}{3}} dx$",
                    "次の不定積分を求めよ：$\\int 3^{2-x} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{(\\log x)^2}{x} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{\\cos x}{\\sin^2 x} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{e^{2x}}{(e^x+1)^2} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{2x-3}{x^2-3x+4} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{1+\\cos x}{x+\\sin x} dx$",
                    "次の不定積分を求めよ：$\\int 2x \\log(x^2+1) dx$",
                    "次の不定積分を求めよ：$\\int (\\log x)^2 dx$",
                    "次の不定積分を求めよ：$\\int \\frac{x^2-x}{x+1} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{3}{x^2-x-2} dx$",
                    "次の不定積分を求めよ：$\\int \\frac{2x+1}{x^2-4} dx$",
                    "次の不定積分を求めよ：$\\int \\cos x \\cos 3x dx$",
                    "次の不定積分を求めよ：$\\int x \\cos^2 x dx$",
                    "次の不定積分を求めよ：$\\int \\sin^3 x \\cos^2 x dx$",
                    "次の不定積分を求めよ：$\\int \\cos^4 x dx$",
                    "次の不定積分を求めよ：$\\int \\frac{dx}{1+\\cos x}$",
                    "$\\tan\\frac{x}{2} = t$ とおいて $\\int \\frac{5}{3\\sin x + 4\\cos x} dx$ を求めよ。",
                    "次の定積分を求めよ：$\\int_0^6 \\left(\\frac{1}{3}x-1\\right)^4 dx$",
                    "次の定積分を求めよ：$\\int_0^1 \\frac{e^x}{e^x+1} dx$",
                    "次の定積分を求めよ：$\\int_0^{\\frac{\\pi}{2}} \\frac{\\sin x}{2+\\cos x} dx$",
                    "次の定積分を求めよ：$\\int_1^2 x \\log(x+1) dx$",
                    "次の定積分を求めよ：$\\int_0^1 (x^2+1)e^x dx$",
                    "次の定積分を求めよ：$\\int_1^2 \\frac{dx}{e^x-e^{-x}}$",
                    "次の定積分を求めよ：$\\int_{-\\frac{3}{2}}^{\\frac{3}{2}} \\sqrt{9-x^2} dx$",
                    "次の定積分を求めよ：$\\int_{-1}^1 \\frac{x^2+x}{(x^2+1)^2} dx$",
                    "次の定積分を求めよ：$\\int_{-\\pi}^\\pi (x\\cos x + \\cos 2x) dx$",
                    "次の定積分を求めよ：$\\int_{-3}^2 (e^x + e^{-x})^3 dx$",
                    "定積分 $\\int_0^{2\\pi} \\sin mx \\cos nx dx$ を求めよ。",
                    "関数 $f(x) = \\int_0^x (1+\\cos t)\\sin t dt \\quad (0 < x < 4\\pi)$ の極値を求めよ。",
                    "極限値 $\\lim_{n \\to \\infty} n \\sum_{k=0}^{n-1} \\frac{1}{(n+k)^2}$ を求めよ。",
                    "不等式 $\\frac{2}{3}n\\sqrt{n} < 1 + \\sqrt{2} + \\dots + \\sqrt{n} < \\frac{2}{3}n\\sqrt{n} + \\sqrt{n}$ を証明せよ。",
                    "$I_n = \\int_0^{\\frac{\\pi}{4}} \\tan^n x dx$ の漸化式を作り、$I_3, I_4$ を求めよ。"
                ],
                "第5章 演習問題A": [
                    "部分分数分解を用いて $\\int \\frac{dx}{x^2(x+3)}$ を求めよ。",
                    "$I = \\int_0^\\pi (x - a\\sin x)^2 dx$ の最小値と、そのときの $a$ の値を求めよ。",
                    "等式 $\\int_0^1 f(x) dx = \\int_0^1 f(1-x) dx$ を証明せよ。",
                    "区分求積法を用いて極限値を求めよ。",
                    "不等式 $\\frac{\\pi}{4} < \\int_0^{\\frac{\\pi}{4}} \\frac{dx}{\\sqrt{1-\\sin x}} < 2 - \\sqrt{4-\\pi}$ を証明せよ。"
                ],
                "第5章 演習問題B": [
                    "関数 $f(x) = \\int_0^{\\frac{\\pi}{2}} |\\sin t - \\sin x| dt \\quad \\left(0 \\le x \\le \\frac{\\pi}{2}\\right)$ の最小値を求めよ。",
                    "等式 $\\int_a^{x^2} f(t) dt = \\log x$ を満たす関数 $f(x)$ と定数 $a$ の値を求めよ。",
                    "不等式 $2\\left(1-\\frac{1}{\\sqrt{e}}\\right) < \\int_0^1 e^{-\\frac{x^2}{2}} dx < 1$ を証明せよ。",
                    "三角関数の直交性に関する定積分問題...",
                    "シュワルツの不等式を定積分を用いて証明せよ。"
                ]
            },
            "第6章 積分法の応用": {
                "第1節 面積・体積・曲線の長さ・速度と道のり": [
                    "次の曲線や直線および $x$ 軸で囲まれた部分の面積を求めよ：$y = \\frac{1}{x^2}, \\quad x=1, x=2$",
                    "次の曲線や直線および $x$ 軸で囲まれた部分の面積を求めよ：$y = \\frac{1}{x}, \\quad x=1, x=e$",
                    "次の曲線や直線および $x$ 軸で囲まれた部分の面積を求めよ：$y = \\cos x \\quad (0 \\le x \\le \\pi), \\quad x=0, x=\\pi$",
                    "次の曲線や直線で囲まれた部分の面積を求めよ：$y = x^3, \\quad y = \\sqrt{x}$",
                    "次の曲線や直線で囲まれた部分の面積を求めよ：$xy = 1, \\quad x + 3y = 4$",
                    "次の曲線と直線で囲まれた部分の面積を求めよ：$y = \\log(2x+1), \\quad y = 2, \\quad y\\text{軸}$",
                    "次の曲線と直線で囲まれた部分の面積を求めよ：$x = y^2, \\quad x = y + 2$",
                    "曲線 $y^2 = x^2(1-x^2)$ で囲まれた図形の面積を求めよ。",
                    "楕円 $x = 3\\cos\\theta, y = 2\\sin\\theta \\quad (0 \\le \\theta \\le 2\\pi)$ で囲まれた部分の面積を求めよ。",
                    "底面積が $S$、高さが $h$ である角錐の体積を積分を用いて求めよ。",
                    "曲線 $y = \\sin 2x \\quad \\left(0 \\le x \\le \\frac{\\pi}{2}\\right)$ を底面とし、各点での $x$ 軸に垂直な断面が正三角形である立体の体積を求めよ。",
                    "次の曲線と直線で囲まれた部分を $x$ 軸の周りに1回転させてできる立体の体積を求めよ：$y = x^2 - 2x, \\quad x\\text{軸}$",
                    "次の曲線と直線で囲まれた部分を $x$ 軸の周りに1回転させてできる立体の体積を求めよ：$y = e^x - 1, \\quad x\\text{軸}, \\quad x = 1$",
                    "楕円 $\\frac{x^2}{a^2} + \\frac{y^2}{b^2} = 1$ で囲まれた部分を $x$ 軸の周りに1回転させてできる立体の体積を求めよ。",
                    "曲線 $y = 1 - \\sqrt{x}$ と $x$ 軸および $y$ 軸で囲まれた部分を $y$ 軸の周りに1回転させてできる立体の体積を求めよ。",
                    "媒介変数で表された曲線 $x = t^2, y = t - \\frac{t^3}{3}$ の $0 \\le t \\le \\sqrt{3}$ の部分の長さを求めよ。",
                    "曲線 $y = \\frac{1}{2}x^2$ の $0 \\le x \\le 1$ の部分の長さを求めよ。",
                    "直線上を運動する点Pの時刻 $t$ における速度が $v(t) = 6 - 2t$ であるとき、時刻 $t=0$ から $t=4$ までの位置の変化量と道のりを求めよ。",
                    "平面上を運動する点Pの位置が $x = \\cos t, y = \\sin t$ で表されるとき、時刻 $t=0$ から $t=2\\pi$ までにPが動く道のりを求めよ。"
                ],
                "第6章 問題": [
                    "曲線 $y = \\log x$ と、この曲線上の点 $(e, 1)$ における接線、および $x$ 軸で囲まれた部分の面積を求めよ。",
                    "曲線 $y = e^x$ と直線 $y = ax$ が接するとき、定数 $a$ の値と、この曲線、直線および $y$ 軸で囲まれた部分の面積を求めよ。",
                    "アステロイド $x = a\\cos^3 t, y = a\\sin^3 t \\quad (0 \\le t \\le 2\\pi)$ で囲まれた領域の面積を求めよ。",
                    "2つの放物線 $y^2 = 4x, x^2 = 4y$ で囲まれた部分を $x$ 軸の周りに1回転させてできる立体の体積を求めよ。",
                    "曲線 $y = \\tan x \\quad \\left(0 \\le x \\le \\frac{\\pi}{4}\\right)$ と $x$ 軸、直線 $x = \\frac{\\pi}{4}$ で囲まれた部分を $x$ 軸の周りに1回転させてできる立体の体積を求めよ。",
                    "サイクロイドの1山と $x$ 軸で囲まれた部分を $x$ 軸の周りに1回転させてできる立体の体積を求めよ。",
                    "曲線 $y = \\log(\\cos x) \\quad \\left(0 \\le x \\le \\frac{\\pi}{3}\\right)$ の長さを求めよ。",
                    "直線上を運動する点Pの道のり計算問題..."
                ],
                "第6章 演習問題A": [
                    "放物線 $y^2 = 2px$ と直線 $x = a$ で囲まれた部分の面積と回転体体積...",
                    "曲線 $y = \\frac{1}{\\cos x}$ と接線で囲まれた面積...",
                    "カテナリー（懸垂線） $y = \\frac{e^x + e^{-x}}{2}$ の曲線の長さ...",
                    "平面上の点の運動と道のりの計算..."
                ],
                "第6章 演習問題B": [
                    "2曲線の交点における共通領域の面積の最小化問題...",
                    "斜め回転体の体積（傘型分割・バウムクーヘン積分など）...",
                    "共通部分の立体の体積（円柱の交差領域など）...",
                    "媒介変数表示された曲線の長さと極座標表記問題..."
                ]
            }
        }
    },
    "複素数": [
        "$\\frac{1-2i}{2-i}$",
        "$\\frac{1}{i^3}$",
        "$\\frac{2i-3}{i}$",
        "$\\frac{1}{1+i}$",
        "$\\frac{5-2i}{5+2i}$",
        "$\\frac{3+2i}{2-i}$",
        "$\\left(\\frac{5+3i}{1+i}\\right)^2$",
        "$\\left(\\frac{3+2i}{2-3i}\\right)^2$",
        "$\\left(\\frac{-1-\\sqrt{3}}{2}\\right)^3$",
        "$\\left(\\frac{2+2i}{2-2i}\\right)^2$",
        "$(2+i)^3$",
        "$\\frac{1+3i}{3-i}\\times\\frac{2i+3}{5i-1}$",
        "$\\frac{1-i}{3+i}+\\frac{1+i}{3-i}$",
        "$\\frac{1-2i}{2+i}+\\frac{2-i}{1+2i}$",
        "$\\frac{1-2i}{3-i}-\\frac{5+i}{5i}$",
        "$\\left(\\frac{7+3i}{2+5i}\\right)^{10}$",
        "$i^{100}$",
        "$(1+\\sqrt{3})^8$",
        "$i+i^2+i^3+i^4$",
        "$i+i^2+i^3+i^4+\\cdots+i^{30}$",
    ],
    "二次関数": {
        "最大値・最小値": [
            "次の二次関数の最大・最小値を求めよ：$y=2x^2-4x+5\\;(-1\\leqq x\\leqq5)$",
            "次の二次関数の最大・最小値を求めよ：$y=\\frac{1}{2}x^2-4x+2\\;(-4\\leqq x\\leqq2)$",
            "次の二次関数の最大・最小値を求めよ：$y=-2x^2+4x+2\\;(0\\leqq x\\leqq6)$",
            "次の二次関数の最大・最小値を求めよ：$y=-x^2-2x+2\\;(-4\\leqq x\\leqq2)$",
            "次の二次関数の最大・最小値を求めよ：$y=3x^2+24x+28\\;(-2\\leqq x\\leqq0)$",
            "次の二次関数の最大・最小値を求めよ：$y=-\\frac{1}{4}x^2-2x+1\\;(-3\\leqq x\\leqq-2)$",
            "次の二次関数の最大・最小値を求めよ：$y=2x^2+\\frac{3}{2}x-2\\;(-1\\leqq x\\leqq0)$",
            "次の二次関数の最大・最小値を求めよ：$y=\\frac{3}{2}x^2+\\frac{7}{3}x+\\frac{7}{3}\\;(-2\\leqq x\\leqq3)$",
            "次の二次関数の最大・最小値を求めよ：$y=-\\frac{4}{3}x^2+2x+1\\;(0\\leqq x\\leqq2)$",
            "次の二次関数の最大・最小値を求めよ：$y=-x^2+x+\\frac{7}{3}\\;(0\\leqq x\\leqq1)$",
        ],
        "決定": [
            "頂点が$(1, 1)$で，点$(-1, 9)$を通る二次関数を求めよ。",
            "頂点が$(3, 6)$で，点$(1, -2)$を通る二次関数を求めよ。",
            "頂点が$(2, 3)$で，点$(3, 6)$を通る二次関数を求めよ。",
            "3点$(0, 3), (-1, 9), (1, 1)$を通る二次関数を求めよ。",
            "3点$(-1, -8), (2, -2), (3, -4)$を通る二次関数を求めよ。",
            "3点$(-1, 5), (2, 5), (3, 9)$を通る二次関数を求めよ。",
            "軸が直線$x=-1$で，2点$(1, 9), (0, 3)$を通る二次関数を求めよ。",
            "軸が直線$x=1$で，2点$(0, 5), (-2, 3)$を通る二次関数を求めよ。",
            "軸が直線$x=1$で，2点$(-1, -5), (2, 1)$を通る二次関数を求めよ。",
            "$x$軸と2点$(1, 0), (4, 0)$で交わり，点$(0, 4)$を通る二次関数を求めよ。",
            "$x$軸と2点$(2, 0), (-3, 0)$で交わり，点$(-1, 18)$を通る二次関数を求めよ。",
            "$x$軸と2点$(1, 0), (-3, 0)$で交わり，点$(-5, 24)$を通る二次関数を求めよ。",
            "$x=3$で最小値が-4となり点$(5, 0)$を通る二次関数を求めよ。",
            "$x=2$で最大値が-3となり点$(1, -4)$を通る二次関数を求めよ。",
            "$x=1$で最小値が2となり点$(3, 6)$を通る二次関数を求めよ。",
            "$y=3x^2$を平行移動したもので，頂点が$(2, -3)$となる二次関数を求めよ。",
            "$y=-2x^2+5x+1$を平行移動したもので，2点$(0, 3), (-2, -7)$を通る二次関数を求めよ。",
            "$y=x^2-3x+1$を平行移動したもので，点$(2, 3)$を通り，その頂点は直線$y=3x-1$上にある二次関数を求めよ。",
        ]
    },
    "二次不等式": {
        "二次不等式": [
            "次の不等式を解け：$x^2-4<0$",
            "次の不等式を解け：$3x^2-x>0$",
            "次の不等式を解け：$x^2-3x+2>0$",
            "次の不等式を解け：$2x^2+9x+9\\geqq 0$",
            "次の不等式を解け：$-3x^2+10x-8>0$",
            "次の不等式を解け：$3x^2-\\sqrt{7}x-1\\geqq 1$",
            "次の不等式を解け：$x^2+x\\leqq 3x+24$",
            "次の不等式を解け：$x^2-4x+2>0$",
            "次の不等式を解け：$x^2+5x+1<0$",
            "次の不等式を解け：$2x^2-9\\geqq 0$",
            "次の不等式を解け：$x^2+12\\geqq 7x$",
            "次の不等式を解け：$4x^2-4x+1>0$",
            "次の不等式を解け：$-3x^2+6x-2\\geqq 0$",
            "次の不等式を解け：$x^2+7x+6\\leqq 0$",
            "次の不等式を解け：$9x^2+1\\leqq 6x$",
            "次の不等式を解け：$x^2-x+3\\geqq 0$",
            "次の不等式を解け：$-2x^2-6x-5>0$",
            "次の不等式を解け：$9x^2+24x+16\\leqq 0$",
            "次の不等式を解け：$-x^2+2x+4\\leqq 0$",
            "次の不等式を解け：$-6x^2+7x+3\\geqq 0$",
        ],
        "連立不等式": [
            "次の連立不等式を解け：$\\begin{cases} x^2+6x+8>0\\\\ x^2+2x-3<0 \\end{cases}$",
            "次の連立不等式を解け：$\\begin{cases} x^2-x-12\\leqq 0\\\\ x^2-3x+2>0 \\end{cases}$",
            "次の連立不等式を解け：$\\begin{cases} x^2+2x-2\\geqq 0\\\\ x^2+2x-8<0 \\end{cases}$",
            "次の連立不等式を解け：$\\begin{cases} 2x^2+5x<3\\\\ 3x^2+11x<4 \\end{cases}$",
            "次の連立不等式を解け：$\\begin{cases} x^2+x-2<0\\\\ x^2+x-1\\geqq 0 \\end{cases}$",
            "次の連立不等式を解け：$\\begin{cases} x^2-10x+20<0\\\\ -x^2+6x-3>0 \\end{cases}$",
            "次の連立不等式を解け：$\\begin{cases} x^2+4x\\geqq 0\\\\ x^2-9>0 \\end{cases}$",
            "次の連立不等式を解け：$\\begin{cases} x^2-4x+1\\leqq 0\\\\ -3x^2+11x+4>0 \\end{cases}$",
            "次の連立不等式を解け：$\\begin{cases} 4x+4\\geqq 3x^2\\\\ 2x^2+1>4x \\end{cases}$",
            "次の連立不等式を解け：$\\begin{cases} x^2+x-1>0\\\\ 6x^2+x-15<0 \\end{cases}$",
        ]
    },
    "三角比・三角関数": {
        "基本の方程式・不等式": [
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $\\sin x = -\\frac{1}{2}$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $2\\cos x = -\\sqrt{3}$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $\\tan x = -1$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，不等式 $\\sin x > \\frac{\\sqrt{3}}{2}$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，不等式 $2\\cos x \\geqq -1$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $2\\sin \\frac{x}{2} = \\sqrt{3}$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，不等式 $\\tan x \\leqq -\\sqrt{3}$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $\\cos\\left(x + \\frac{\\pi}{3}\\right) = \\frac{\\sqrt{3}}{2}$ を解け。",
        ],
        "2倍角，合成などを用いる方程式・不等式": [
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $2\\cos^2 x - \\sin x - 1 = 0$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，不等式 $2\\sin^2 x + \\cos x - 1 \\leqq 0$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $\\cos x + \\cos 2x = 0$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，不等式 $\\sin 2x + \\cos x \\leqq 0$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，不等式 $\\cos 2x - 3\\cos x + 2 < 0$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $\\sin x \\cos x = \\frac{1}{4}$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $\\cos^4 x - \\sin^4 x = -1$ を解け。",
            "$0 \\leqq x \\leqq \\pi$ のとき，方程式 $\\sin x \\cos x \\cos 2x = -\\frac{1}{8}$ を解け。",
            "$0 \\leqq \\theta < 2\\pi$ のとき，不等式 $\\cos 2\\theta + \\sqrt{3}\\sin \\theta \\geqq 1$ を解け。",
            "$0 < x < \\frac{\\pi}{2}$ のとき，方程式 $\\frac{\\sin x}{\\cos x} + \\frac{\\cos x}{\\sin x} = 4$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，不等式 $\\cos 2x + 3\\cos x - 1 \\leqq 0$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，不等式 $2(\\cos^2 x - \\sin^2 x) \\leqq -\\sqrt{3}$ を解け。",
            "$0 < x < \\frac{\\pi}{2}$ のとき，方程式 $\\cos^2 x - \\sin^2 x + \\frac{1}{16} \\left( \\frac{1}{\\cos^2 x} - \\frac{1}{\\sin^2 x} \\right) = 0$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $\\sin x + \\cos x = -1$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $\\sqrt{3}\\sin x + 3\\cos x = -3$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $\\sin 2x - \\sqrt{3}\\cos 2x = 1$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，不等式 $\\sin x - \\cos x \\leqq \\frac{\\sqrt{2}}{2}$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，不等式 $\\sqrt{3}\\sin x - \\cos x < 1$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $\\sin\\left(x + \\frac{\\pi}{3}\\right) - \\sin x = 1$ を解け。",
            "$0 \\leqq x \\leqq \\pi$ のとき，不等式 $2\\sin x \\cos x + \\sqrt{3}\\cos 2x + \\sqrt{3} < 0$ を解け。",
            "$0 \\leqq \\theta < 2\\pi$ のとき，不等式 $\\cos\\left(\\theta + \\frac{\\pi}{4}\\right) + \\cos\\left(\\theta - \\frac{\\pi}{4}\\right) \\leqq 1$ を解け。",
            "$0 \\leqq x \\leqq \\pi$ のとき，不等式 $-1 < \\cos x - \\sin x < \\frac{\\sqrt{2}}{2}$ を解け。",
            "$\\frac{\\pi}{2} \\leqq \\theta \\leqq \\pi$ のとき，方程式 $2\\sin\\left(\\theta + \\frac{\\pi}{5}\\right) - 2\\cos\\left(\\theta + \\frac{\\pi}{30}\\right) = 1$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，不等式 $\\sin 2x > \\sqrt{2}\\cos\\left(x + \\frac{\\pi}{4}\\right) + \\frac{1}{2}$ を解け。",
            "$0 < \\theta < \\frac{\\pi}{2}$ のとき，不等式 $\\cos 3\\theta + 2\\cos \\theta > 0$ を解け。",
            "$0 \\leqq x < 2\\pi$ のとき，方程式 $\\cos x + \\cos 2x + \\cos 3x = 0$ を解け。",
            "$0 < x < \\pi$ のとき，方程式 $\\sqrt{3}\\sin 2x - \\cos 2x - \\frac{1}{\\sqrt{3}}(\\sqrt{3}\\sin x + \\cos x) = 0$ を解け。",
        ],
        "最大値・最小値": [
            "$0 \\leqq x \\leqq \\pi$ のとき，$y = \\sin x - \\cos x$ の最大値，最小値とそのときの $x$ の値を求めよ。",
            "$0 \\leqq x \\leqq \\pi$ のとき，$y = 3\\sin x + 4\\cos x$ の最大値，最小値を求めよ。",
            "$0 \\leqq x < 2\\pi$ のとき，$y = \\cos^2 x + \\sin x - 1$ の最大値，最小値とそのときの $x$ の値を求めよ。",
            "$0 \\leqq x < 2\\pi$ のとき，$y = \\cos 2x + 2\\cos x - 2$ の最大値，最小値とそのときの $x$ の値を求めよ。",
            "$0 \\leqq \\theta \\leqq \\frac{\\pi}{2}$ のとき，$y = \\cos^2 2\\theta + 2\\sin 2\\theta + 2$ の最大値，最小値とそのときの $\\theta$ を求めよ。",
            "$0 \\leqq \\theta \\leqq 2\\pi$ のとき，$y = 2\\cos \\theta + 4\\sqrt{3}\\sin\\left(\\frac{\\theta}{2} - \\frac{\\pi}{2}\\right)$ の最大値，最小値とそのときの $\\theta$ の値を求めよ。",
            "$0 \\leqq \\theta \\leqq \\pi$ のとき，$f(\\theta) = \\sin^4 \\theta + \\cos^4 \\theta$ の最大値，最小値とそのときの $\\theta$ を求めよ。",
            "$0 < x \\leqq \\frac{\\pi}{2}$ のとき，$y = \\frac{2 - \\cos^2 x + \\frac{1}{4}}{\\sin^2 x}$ の最小値とそのときの $x$ の値を求めよ。",
            "$0 \\leqq \\theta \\leqq \\pi$ のとき，$y = \\sin \\frac{\\theta}{2} + \\cos(\\frac{\\theta}{2} - \\frac{\\pi}{6})$ の最大値，最小値とそのときの $\\theta$ を求めよ。",
            "$\\theta$ を実数とし，$y = \\cos 2\\theta - \\sin \\theta + 2\\sin\\left(\\theta + \\frac{\\pi}{3}\\right)$ の最大値と最小値を求めよ。",
        ],
        "図形・応用問題": [
            "$\\alpha = \\frac{\\pi}{5}$ とおくと，$5\\alpha = \\pi$ である。これを用いて，$\\cos \\frac{\\pi}{5}$ の値を求めよ。",
            "2直線 $\\ell: y = 3x - 1, m: y = \\frac{1}{2}x$ のなす角 $\\theta \\left(0 \\leqq \\theta \\leqq \\frac{\\pi}{2}\\right)$ を求めよ。",
            "座標平面上に $A(1, 0), P(\\cos 2\\theta, \\sin 2\\theta), Q(2\\cos 3\\theta, 2\\sin 3\\theta)$ をとる。$\\theta$ が $\\frac{\\pi}{3} \\leqq \\theta < \\pi$ の範囲を動くとき，$AP^2 + PQ^2$ の最大値，最小値とそのときの $\\theta$ の値を求めよ。",
            "$0 < x < 2\\pi$ のとき，方程式 $\\sin 5x = \\sin x$ を解け。",
            "$0 \\leqq x \\leqq \\pi$ のとき，方程式 $\\sin x + \\sin 2x + \\sin 3x = \\cos x + \\cos 2x + \\cos 3x$ を解け。",
        ]
    },
    "指数・対数": {
        "指数の方程式・不等式": [
            "方程式 $4^x = 2^{x+3}$ を解け。",
            "方程式 $27^{x+1} = 9^{2x+3}$ を解け。",
            "不等式 $\\left( \\frac{1}{2} \\right)^{x-2} > \\left( \\frac{1}{8} \\right)^x$ を解け。",
            "方程式 $9^x - 10 \\cdot 3^x + 9 = 0$ を解け。",
            "方程式 $2^{2x+1} = 3 \\cdot 2^{x+2} + 32$ を解け。",
            "方程式 $8^x + 8 = 3(4^x + 2^{x+1})$ を解け。",
            "方程式 $8^x + 4^x = 9 \\cdot 2^x + 9$ を解け。",
            "不等式 $2^{2x+1} - 7 \\cdot 2^x - 4 < 0$ を解け。",
            "不等式 $4^x - 6 \\cdot 2^x + 8 > 0$ を解け。",
            "$6 \\cdot 3^x + 7 \\sqrt{3^x} - 3 = 0$ を解け。",
        ],
        "対数の方程式・不等式": [
            "方程式 $\\log_3 x = 4$ を解け。",
            "方程式 $\\log_8 x = \\frac{1}{2}$ を解け。",
            "方程式 $\\log_2 x + \\log_2(x+3) = 2$ を解け。",
            "不等式 $\\log_2(x-3) < 4$ を解け。",
            "不等式 $\\log_{\\frac{1}{3}} x < 2$ を解け。",
            "不等式 $\\log_3(x+5) + \\log_3(7-x) < 3$ を解け。",
            "不等式 $(\\log_{\\frac{1}{2}} x)^2 - \\log_{\\frac{1}{2}} x^3 < 4$ を解け。",
            "方程式 $(\\log_2 x)^2 + \\log_2(4x^2) - 5 \\geqq 0$ を解け。",
            "方程式 $(\\log_3 x)^2 = \\log_3 9x$ を解け。",
        ],
        "最大値・最小値": [
            "$y = 2^{2x+1} - 2^x + 1$ の最小値とそのときの $x$ の値を求めよ。",
            "$y = 2^{x+3} - 3 \\cdot 4^x$ ($0 \\leqq x \\leqq 2$) の最大値，最小値とそのときの $x$ の値を求めよ。",
            "$y = 2(4^x + 4^{-x}) - 4(2^x + 2^{-x}) + 3$ の最小値とそのときの $x$ の値を求めよ。",
            "$y = 2(\\log_5 x)^2 - \\log_5 x^8 + 6$ ($1 \\leqq x \\leqq 125$) の最大値，最小値とそのときの $x$ の値を求めよ。",
        ],
        "常用対数・桁数": [
            "$\\log_{10} 2 = 0.3010$ とする。$2^{50}$ の桁数を求めよ。",
            "$\\log_{10} 2 = 0.3010, \\log_{10} 3 = 0.4771$ とする。$6^{200}$ の桁数を求めよ。",
            "$\\log_{10} 2 = 0.3010$ とする。$5^{100}$ の桁数を求めよ。",
        ]
    },
    "漸化式": {
        "等差・等比・階差型": [
            "$a_1 = 1, a_{n+1} = a_n + 4$",
            "$a_1 = 5, a_{n+1} = a_n - 7$",
            "$a_1 = 3, a_{n+1} = 2a_n$",
            "$a_1 = 9, a_{n+1} = \\frac{1}{3}a_n$",
            "$a_1 = 1, a_{n+1} = a_n + 4n - 3$",
            "$a_1 = 2, a_{n+1} = a_n + 3^n$",
        ],
        "$a_{n+1} = pa_n + q$ 型": [
            "$a_1 = 1, a_{n+1} = 3a_n + 4$",
            "$a_1 = 5, a_{n+1} = \\frac{1}{2}a_n + 3$",
            "$a_1 = 2, a_{n+1} = -2a_n - 9$",
            "$a_1 = 3, a_{n+1} + a_n = 4$",
        ],
        "隣接3項間漸化式": [
            "$a_1 = 1, a_2 = 4, a_{n+2} - a_{n+1} - 6a_n = 0$",
            "$a_1 = 1, a_2 = 2, a_{n+2} - 3a_{n+1} + 2a_n = 0$",
            "$a_1 = 1, a_2 = 8, a_{n+2} - 8a_{n+1} + 15a_n = 0$",
        ]
    },
    "微分": {
        "極限値（微分の定義）": [
            "次の極限値を$a, f(a), f^{\\prime}(a)$を用いて表せ：$\\lim_{x\\to a}\\frac{f(x)-f(a)}{x-a}$",
            "次の極限値を$a, f(a), f^{\\prime}(a)$を用いて表せ：$\\lim_{x\\to a}\\frac{a^2f(x)-x^2f(a)}{x-a}$",
        ],
        "導関数の定義に従って微分": [
            "導関数の定義に従って微分せよ：$y=x^2+3x-2$",
            "導関数の定義に従って微分せよ：$y=\\frac{1}{x}$",
        ],
        "接線・法線": [
            "次の関数上の点における接線，法線の方程式を求めよ：$y=x^2+4\\quad(1, 5)$",
            "次の関数上の点における接線，法線の方程式を求めよ：$y=x^2-7x+8\\quad(1, 2)$",
        ],
        "増減を調べグラフを描く": [
            "次の関数の増減を調べ，グラフを描け：$y=x^3-2x^2+3x-5$",
            "次の関数の増減を調べ，グラフを描け：$y=-x^3+6x$",
        ]
    },
    "積分（数Ⅱ）": {
        "定積分": [
            "次の定積分を求めよ：$\\int_{0}^{1}(2x-3)dx$",
            "次の定積分を求めよ：$\\int_{-2}^{1}(x^2-3x-4)dx$",
            "次の定積分を求めよ：$\\int_{-1}^{3}(x-2)^2dx$",
        ],
        "面積": [
            "次の曲線や直線で囲まれた図形の面積を求めよ：$y=x^2-3x+5, y=2x-1$",
            "次の曲線や直線で囲まれた図形の面積を求めよ：$y=x^3-3x+2, x軸$",
        ]
    },
    "極限": [
        "$\\lim_{n\\to \\infty}\\frac{4n+1}{n}$",
        "$\\lim_{n\\to\\infty}\\frac{2n-3}{n+1}$",
        "$\\lim_{n\\to\\infty}\\frac{3n^2+4n}{2n^2-3}$",
        "$\\lim_{n\\to\\infty}\\frac{4n^3-2n^2+1}{3n^3+4n}$",
        "$\\lim_{x \\to 0} \\frac{\\sin 3x}{x}$",
        "$\\lim_{x \\to 0} \\frac{1 - \\cos x}{x^2}$",
    ]
}


# ---------------------------------------------------------
# PDFプレビュー & 印刷機能
# ---------------------------------------------------------
def render_pdf_preview_and_print(pdf_bytes: bytes):
    base64_pdf = base64.b64encode(pdf_bytes).decode("utf-8")

    print_html = f"""
    <!DOCTYPE html>
    <html>
    <head>
        <meta charset="utf-8">
        <style>
            .print-btn {{
                background-color: #ff4b4b;
                color: white;
                border: none;
                padding: 12px 24px;
                font-size: 16px;
                font-weight: bold;
                border-radius: 8px;
                cursor: pointer;
                box-shadow: 0 4px 6px rgba(0,0,0,0.1);
                width: 100%;
                text-align: center;
                font-family: sans-serif;
            }}
            .print-btn:hover {{
                background-color: #ff2222;
            }}
        </style>
    </head>
    <body>
        <button class="print-btn" onclick="openPrintWindow()">このまま印刷する</button>
        <script>
            function openPrintWindow() {{
                const pdfData = "{base64_pdf}";
                const byteCharacters = atob(pdfData);
                const byteNumbers = new Array(byteCharacters.length);
                for (let i = 0; i < byteCharacters.length; i++) {{
                    byteNumbers[i] = byteCharacters.charCodeAt(i);
                }}
                const byteArray = new Uint8Array(byteNumbers);
                const blob = new Blob([byteArray], {{type: 'application/pdf'}});
                const blobUrl = URL.createObjectURL(blob);
                const printWindow = window.open(blobUrl, '_blank');
                if (printWindow) {{
                    printWindow.onload = function() {{
                        printWindow.print();
                    }};
                }}
            }}
        </script>
    </body>
    </html>
    """

    st.markdown("### プレビュー & 印刷")
    components.html(print_html, height=65)
    st.markdown("---")

    try:
        doc = fitz.open(stream=pdf_bytes, filetype="pdf")
        for page_num in range(len(doc)):
            page = doc.load_page(page_num)
            pix = page.get_pixmap(dpi=150)
            img = Image.open(io.BytesIO(pix.tobytes("png")))

            st.image(
                img,
                caption=f"第 {page_num + 1} / {len(doc)} ページ",
                width=500,
            )
            if page_num < len(doc) - 1:
                st.markdown("---")
    except Exception as e:
        st.error(f"プレビューの生成に失敗しました: {e}")


# ---------------------------------------------------------
# LaTeXコンパイル関数
# ---------------------------------------------------------
def compile_latex_to_pdf(latex_code: str) -> bytes:
    with tempfile.TemporaryDirectory() as tmpdir:
        tex_path = os.path.join(tmpdir, "output.tex")
        with open(tex_path, "w", encoding="utf-8") as f:
            f.write(latex_code)

        try:
            subprocess.run(
                ["lualatex", "-interaction=nonstopmode", "output.tex"],
                cwd=tmpdir,
                stdout=subprocess.PIPE,
                stderr=subprocess.PIPE,
                check=True,
            )
            pdf_path = os.path.join(tmpdir, "output.pdf")
            if os.path.exists(pdf_path):
                with open(pdf_path, "rb") as f:
                    return f.read()
        except subprocess.CalledProcessError as e:
            st.error("LaTeXのコンパイルエラーが発生しました。")
            log_path = os.path.join(tmpdir, "output.log")
            if os.path.exists(log_path):
                with open(log_path, "r", encoding="utf-8", errors="ignore") as log_f:
                    st.text_area("コンパイルログ", log_f.read(), height=200)
            raise e

    return b""


# ---------------------------------------------------------
# メイン画面のUI（階層構造の展開）
# ---------------------------------------------------------
st.title("数学のガチャ")

st.markdown("---")
st.subheader("分野の選択と出題数設定")
st.write("各分野・教科書の階層を展開し、出題したい項目にチェックを入れて出題数を設定してください。")

selected_units_config = {}

for top_key, top_val in question_database.items():
    if top_key == "教科書":
        is_textbook = st.checkbox("教科書", key="chk_textbook")
        if is_textbook:
            for subject, chapters in top_val.items():
                is_subj = st.checkbox(f"  └ {subject}", key=f"chk_{subject}")
                if is_subj:
                    for chap_name, sections in chapters.items():
                        is_chap = st.checkbox(f"    └ {chap_name}", key=f"chk_{subject}_{chap_name}")
                        if is_chap:
                            for sec_name, subsections in sections.items():
                                is_sec = st.checkbox(f"      └ {sec_name}", key=f"chk_{subject}_{chap_name}_{sec_name}")
                                if is_sec:
                                    for sub_name, q_list in subsections.items():
                                        sub_chk = st.checkbox(f"        └ {sub_name} （全 {len(q_list)} 問）", key=f"chk_{subject}_{chap_name}_{sec_name}_{sub_name}")
                                        if sub_chk:
                                            max_q = len(q_list)
                                            num_q = st.number_input(
                                                f"          出題数 (最大 {max_q}問)",
                                                min_value=0, max_value=max_q, value=0, step=1,
                                                key=f"num_{subject}_{chap_name}_{sec_name}_{sub_name}"
                                            )
                                            if num_q > 0:
                                                selected_units_config[f"{subject} > {chap_name} > {sec_name} > {sub_name}"] = (q_list, int(num_q))
    else:
        # その他の単元（複素数、二次関数、三角関数、指数対数など）
        is_major_checked = st.checkbox(f"{top_key}", key=f"maj_{top_key}")
        if is_major_checked:
            if isinstance(top_val, list):
                sub_chk = st.checkbox(f" └ {top_key} （全 {len(top_val)} 問）", key=f"sub_list_{top_key}")
                if sub_chk:
                    max_q = len(top_val)
                    num_q = st.number_input(
                        f"  出題数 (最大 {max_q}問)",
                        min_value=0, max_value=max_q, value=0, step=1,
                        key=f"num_list_{top_key}"
                    )
                    if num_q > 0:
                        selected_units_config[top_key] = (top_val, int(num_q))
            elif isinstance(top_val, dict):
                for sub_cat, q_list in top_val.items():
                    sub_chk = st.checkbox(f" └ {sub_cat} （全 {len(q_list)} 問）", key=f"sub_dict_{top_key}_{sub_cat}")
                    if sub_chk:
                        max_q = len(q_list)
                        num_q = st.number_input(
                            f"  出題数 (最大 {max_q}問)",
                            min_value=0, max_value=max_q, value=0, step=1,
                            key=f"num_dict_{top_key}_{sub_cat}"
                        )
                        if num_q > 0:
                            selected_units_config[f"{top_key} > {sub_cat}"] = (q_list, int(num_q))

st.markdown("---")

# プレビューを表示ボタン
if st.button("プレビューを表示", type="primary"):
    if not selected_units_config:
        st.warning("項目にチェックを入れ、1問以上の問題数を入力してください。")
    else:
        latex_source = f"""
        \\documentclass[11pt,a4paper]{{ltjsarticle}}
        \\package{{amsmath,amssymb,amsthm}}
        \\everymath{{\\displaystyle}}
        \\begin{{document}}
        \\begin{{center}}
            {{\\Large \\textbf{{数学のガチャ}}}}
        \\end{{center}}
        \\vspace{{1em}}
        \\noindent \\textbf{{氏名: \\underline{{\\hspace{{5cm}}}}}}
        \\vspace{{1.5em}}
        \\hrule
        \\vspace{{1em}}
        """

        units_list = list(selected_units_config.items())
        random.shuffle(units_list)

        global_q_index = 1
        for cat_name, (q_list, count) in units_list:
            selected_questions = random.sample(q_list, count)
            for q_text in selected_questions:
                latex_source += f"""
                \\begin{{samepage}}
                \\noindent \\textbf{{({global_q_index})}} {q_text}
                \\vspace{{1.5em}}
                \\end{{samepage}}
                """
                global_q_index += 1

        latex_source += """
        \\end{document}
        """

        with st.spinner("PDFをコンパイル中..."):
            try:
                pdf_data = compile_latex_to_pdf(latex_source)
                st.session_state["pdf_data"] = pdf_data
                st.success("プレビューの生成が完了しました！")
            except Exception:
                st.error("PDFの生成に失敗しました。")

# 生成されたPDFがある場合の表示
if "pdf_data" in st.session_state:
    st.markdown("---")
    render_pdf_preview_and_print(st.session_state["pdf_data"])

    st.download_button(
        label="生成されたPDFをダウンロード",
        data=st.session_state["pdf_data"],
        file_name="math_ガチャ.pdf",
        mime="application/pdf",
    )
